99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
#include "esp32_mquickjs_espnow.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_espnow_tx_queue.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wifi_radio.h"
#include "esp32_mquickjs_wireless_core.h"
#include "utils/esp32_mquickjs_byte_source.h"

#include <stdatomic.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "esp_check.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_now.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"

#define ESPNOW_ADDRESS_BYTES ESP_NOW_ETH_ALEN
#define ESPNOW_REOPEN_QUIESCE_MS 50U
#define ESPNOW_CLOSE_TIMEOUT_MS 1000U
#define ESPNOW_TX_TASK_STACK_BYTES 4096U
static const char *TAG = "esp32qjs_espnow";
#if defined(CONFIG_ESP32_MQUICKJS_ESPNOW_ALLOW_V2_PAYLOAD) && \
    CONFIG_ESP32_MQUICKJS_ESPNOW_ALLOW_V2_PAYLOAD
#define ESPNOW_V2_PAYLOAD_ENABLED 1
#else
#define ESPNOW_V2_PAYLOAD_ENABLED 0
#endif

typedef enum {
    ESPNOW_LIFECYCLE_CLOSED = 0,
    ESPNOW_LIFECYCLE_OPENING,
    ESPNOW_LIFECYCLE_ACTIVE,
    ESPNOW_LIFECYCLE_CLOSING,
    ESPNOW_LIFECYCLE_FAILED,
} espnow_lifecycle_t;

typedef struct {
    uint32_t generation;
    uint32_t sequence;
    int64_t timestamp_us;
    uint8_t source[ESPNOW_ADDRESS_BYTES];
    uint8_t destination[ESPNOW_ADDRESS_BYTES];
    int8_t rssi;
    uint8_t channel;
    uint16_t length;
    uint8_t *payload;
} espnow_rx_slot_t;

typedef struct {
    uint32_t generation;
    uint16_t slot_index;
} espnow_receive_event_t;

typedef struct {
    uint32_t generation;
} espnow_session_ref_t;

typedef struct {
    uint32_t session_generation;
    uint16_t peer_index;
    uint32_t peer_generation;
} espnow_peer_ref_t;

typedef struct {
    bool configured;
    wifi_phy_mode_t phy_mode;
    wifi_phy_rate_t phy_rate;
    uint8_t mcs;
    bool short_guard_interval;
    bool ersu;
    bool dcm;
} espnow_peer_rate_config_t;

typedef struct {
    bool allocated;
    bool reserved;
    uint32_t generation;
    uint8_t address[ESPNOW_ADDRESS_BYTES];
    uint8_t channel;
    bool encrypted;
    uint8_t lmk[ESP_NOW_KEY_LEN];
    espnow_peer_rate_config_t rate_config;
} espnow_peer_slot_t;

typedef struct {
    uint8_t address[ESPNOW_ADDRESS_BYTES];
    uint16_t length;
} espnow_tx_packet_t;

typedef enum {
    ESPNOW_OPERATION_OPEN = 0,
    ESPNOW_OPERATION_ADD_PEER,
    ESPNOW_OPERATION_UPDATE_PEER,
    ESPNOW_OPERATION_CLOSE_PEER,
    ESPNOW_OPERATION_SEND,
    ESPNOW_OPERATION_SET_POWER_SAVE,
    ESPNOW_OPERATION_RECOVER,
    ESPNOW_OPERATION_CLOSE_SESSION,
} espnow_operation_t;

typedef struct {
    portMUX_TYPE lock;
    _Atomic espnow_lifecycle_t lifecycle;
    esp32_mquickjs_runtime_t *runtime;
    _Atomic uint32_t generation;
    esp32_mquickjs_wifi_radio_lease_t radio_lease;
    esp32_mquickjs_event_queue_t *event_queue;
    bool event_queue_retained;
    esp32_mquickjs_native_pool_t rx_free;
    espnow_rx_slot_t *rx_slots;
    uint8_t *rx_payloads;
    uint32_t receive_capacity;
    uint32_t max_payload_bytes;
    uint32_t send_timeout_ms;
    _Atomic uint8_t channel;
    _Atomic uint32_t channel_generation;
    bool channel_fixed;
    bool now_initialized;
    bool receive_callback_registered;
    bool send_callback_registered;
    bool broadcast_peer_added;
    espnow_peer_rate_config_t broadcast_rate_config;
    espnow_peer_slot_t peers[CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS];
    uint32_t peer_count;
    uint32_t encrypted_peer_count;
    _Atomic(esp32_mquickjs_future_driver_state_t *) active_send;
    _Atomic(esp32_mquickjs_future_driver_state_t *) pending_tracked_send;
    _Atomic uint32_t pending_sends;
    esp32_mquickjs_wireless_tx_state_t tx_state;
    esp32_mquickjs_espnow_tx_queue_t tx_queue;
    esp32_mquickjs_espnow_tx_slot_link_t *tx_links;
    espnow_tx_packet_t *tx_packets;
    uint8_t *tx_payloads;
    uint8_t *tx_staging;
    uint16_t tx_queue_capacity;
    esp32_mquickjs_espnow_tx_overflow_t tx_overflow;
    _Atomic(TaskHandle_t) tx_task;
    _Atomic bool tx_task_stop;
    _Atomic bool tx_task_exited;
    StackType_t *tx_task_stack;
    StaticTask_t tx_task_buffer;
    _Atomic uint32_t active_queued_slot;
    _Atomic bool queued_send_completed;
    _Atomic bool queued_send_delivered;
    _Atomic int queued_send_error;
    _Atomic int64_t queued_send_started_us;
    _Atomic uint32_t next_batch_sequence;
    _Atomic uint32_t tx_accepted_batches;
    _Atomic uint32_t tx_accepted_packets;
    _Atomic uint32_t tx_rejected_batches;
    _Atomic uint32_t tx_rejected_packets;
    _Atomic uint32_t tx_evicted_batches;
    _Atomic uint32_t tx_evicted_packets;
    _Atomic uint32_t tx_completed_batches;
    _Atomic uint32_t tx_completed_packets;
    _Atomic uint32_t tx_failed_packets;
    _Atomic uint32_t tx_high_water_packets;
    _Atomic int tx_last_error;
    bool has_pmk;
    uint8_t pmk[ESP_NOW_KEY_LEN];
    bool power_save_enabled;
    bool power_save_cleanup_required;
    bool power_save_fault;
    esp32_mquickjs_wifi_interval_token_t interval_token;
    uint16_t wake_window_ms;
    uint16_t wake_interval_ms;
    _Atomic uint32_t callbacks_active;
    _Atomic bool cleanup_scheduled;
    _Atomic esp_err_t cleanup_error;
    _Atomic(const char *) cleanup_stage;
    uint8_t close_power_phase;
    bool reaper_registered;
    _Atomic(esp32_mquickjs_future_driver_state_t *) active_close;
    _Atomic uint32_t sequence;
    _Atomic uint32_t received_packets;
    _Atomic uint32_t received_bytes;
    _Atomic uint32_t dropped_packets;
    _Atomic uint32_t malformed_packets;
    _Atomic uint32_t sent_packets;
    _Atomic uint32_t sent_bytes;
    _Atomic uint32_t send_successes;
    _Atomic uint32_t send_failures;
    _Atomic uint32_t send_timeouts;
} espnow_session_t;

struct esp32_mquickjs_future_driver_state {
    JSContext *ctx;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    JSGCRef event_queue_ref;
    JSGCRef owner_ref;
    espnow_operation_t operation;
    uint32_t generation;
    uint16_t peer_index;
    uint32_t peer_generation;
    uint8_t address[ESPNOW_ADDRESS_BYTES];
    uint8_t peer_channel;
    bool encrypted;
    bool has_lmk;
    uint8_t lmk[ESP_NOW_KEY_LEN];
    espnow_peer_rate_config_t peer_rate_config;
    espnow_peer_rate_config_t broadcast_rate_config;
    uint8_t *payload;
    size_t payload_length;
    uint32_t max_payload_bytes;
    uint32_t receive_capacity;
    uint32_t send_timeout_ms;
    uint16_t tx_queue_capacity;
    esp32_mquickjs_espnow_tx_overflow_t tx_overflow;
    uint8_t channel;
    bool channel_fixed;
    bool has_pmk;
    uint8_t pmk[ESP_NOW_KEY_LEN];
    bool power_save_enabled;
    uint16_t wake_window_ms;
    uint16_t wake_interval_ms;
    int64_t open_not_before_us;
    int64_t completed_at_us;
    esp_err_t err;
    const char *failed_step;
    bool mac_delivered;
    bool timed_out;
    bool recovery_failed;
    bool result_bool;
    bool event_queue_rooted;
    bool owner_rooted;
    bool peer_reserved;
    bool send_reserved;
    bool started;
    _Atomic bool submitted;
    bool open_initialization_started;
    bool transferred;
    bool cancelled;
    _Atomic bool completed;
    _Atomic bool recovery_pending;
    _Atomic bool recovery_worker_submitted;
};

static const uint8_t s_broadcast_address[ESPNOW_ADDRESS_BYTES] = {
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
};
static espnow_session_t s_espnow_session = {
    .lock = portMUX_INITIALIZER_UNLOCKED,
    .lifecycle = ESPNOW_LIFECYCLE_CLOSED,
};
static _Atomic uint32_t s_espnow_next_generation = 1;
static _Atomic uint32_t s_espnow_next_peer_generation = 1;
static int64_t s_espnow_reopen_not_before_us;
static espnow_session_ref_t s_espnow_closed_session_ref;
static espnow_peer_ref_t s_espnow_closed_peer_ref;
static const uint8_t s_espnow_tx_lane_key;
static const uint8_t s_espnow_control_lane_key;

