99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
static JSValue espnow_status_to_js(JSContext *ctx,
                                   espnow_session_t *session);
static bool espnow_parse_rate_config(
    JSContext *ctx, JSValue value, const char *operation,
    espnow_peer_rate_config_t *out_config);
static void espnow_close_native(espnow_session_t *session);
static void espnow_close_worker(void *opaque);
static void espnow_request_reap(espnow_session_t *session);
static void espnow_tx_worker(void *opaque);
static void espnow_notify_tx_worker(espnow_session_t *session);

static void espnow_note_native_deinit(void)
{
    s_espnow_reopen_not_before_us =
        esp_timer_get_time() + (int64_t)ESPNOW_REOPEN_QUIESCE_MS * 1000;
}

static void espnow_retire_handle(JSContext *ctx, JSValue value,
                                 int class_id, void *closed_ref)
{
    void *ref;

    if (ctx == NULL || closed_ref == NULL ||
        JS_GetClassID(ctx, value) != class_id ||
        (ref = JS_GetOpaque(ctx, value)) == NULL || ref == closed_ref) {
        return;
    }
    JS_SetOpaque(ctx, value, closed_ref);
    esp32_mquickjs_memory_payload_free(ref);
}

static JSValue espnow_future_call_and_wait(JSContext *ctx,
                                           JSValue receiver,
                                           const char *method_name,
                                           int argc,
                                           JSValue *argv)
{
    JSGCRef receiver_ref;
    JSGCRef method_ref;
    JSValue *rooted_receiver = JS_PushGCRef(ctx, &receiver_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *rooted_receiver = receiver;
    *method = JS_GetPropertyStr(ctx, *rooted_receiver, method_name);
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *rooted_receiver, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    return result;
}

static bool espnow_is_object(JSContext *ctx, JSValue value)
{
    return JS_GetClassID(ctx, value) >= 0 && !JS_IsArray(ctx, value);
}

static bool espnow_string_equals(JSContext *ctx,
                                 JSValue value,
                                 const char *expected)
{
    JSCStringBuf buffer;
    const char *text;

    if (!JS_IsString(ctx, value)) {
        return false;
    }
    text = JS_ToCString(ctx, value, &buffer);
    return text != NULL && strcmp(text, expected) == 0;
}

static bool espnow_to_u32(JSContext *ctx, JSValue value, uint32_t *out)
{
    int raw;

    if (out == NULL || JS_ToInt32(ctx, &raw, value) != 0 || raw < 0) {
        return false;
    }
    *out = (uint32_t)raw;
    return true;
}

static bool espnow_validate_option_keys(JSContext *ctx,
                                        JSValue options,
                                        const char *api_name,
                                        const char *const *allowed,
                                        size_t allowed_count)
{
    return esp32_mquickjs_validate_plain_options(
        ctx, options, api_name, allowed, allowed_count);
}

static void espnow_format_address(const uint8_t address[ESPNOW_ADDRESS_BYTES],
                                  char output[18])
{
    esp32_mquickjs_wireless_format_address(address, output);
}

static bool espnow_parse_address(JSContext *ctx,
                                 JSValue value,
                                 const char *api_name,
                                 bool allow_broadcast,
                                 uint8_t output[ESPNOW_ADDRESS_BYTES])
{
    JSCStringBuf buffer;
    const char *text;

    if (!JS_IsString(ctx, value) ||
        (text = JS_ToCString(ctx, value, &buffer)) == NULL ||
        !esp32_mquickjs_wireless_parse_address(text, output)) {
        JS_ThrowTypeError(ctx, "ESPNOW_INVALID_ADDRESS: %s expects xx:xx:xx:xx:xx:xx",
                          api_name);
        return false;
    }
    if ((!allow_broadcast &&
         memcmp(output, s_broadcast_address, ESPNOW_ADDRESS_BYTES) == 0) ||
        (!allow_broadcast && (output[0] & 1U) != 0U)) {
        JS_ThrowTypeError(ctx,
                          "ESPNOW_INVALID_ADDRESS: multicast and broadcast are not ordinary peers");
        return false;
    }
    return true;
}

static espnow_peer_slot_t *espnow_find_peer_by_address(
    espnow_session_t *session,
    const uint8_t address[ESPNOW_ADDRESS_BYTES],
    uint16_t *out_index)
{
    uint16_t i;

    if (session == NULL) {
        return NULL;
    }
    for (i = 0; i < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS; ++i) {
        espnow_peer_slot_t *peer = &session->peers[i];

        if (peer->allocated &&
            memcmp(peer->address, address, ESPNOW_ADDRESS_BYTES) == 0) {
            if (out_index != NULL) {
                *out_index = i;
            }
            return peer;
        }
    }
    return NULL;
}

static espnow_peer_slot_t *espnow_peer_from_value(
    JSContext *ctx,
    JSValue value,
    espnow_peer_ref_t **out_ref,
    bool throw_if_stale)
{
    espnow_peer_ref_t *ref;
    espnow_peer_slot_t *peer = NULL;

    if (JS_GetClassID(ctx, value) != JS_CLASS_ESPNOW_PEER ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected an EspNowPeer instance");
        return NULL;
    }
    if (s_espnow_session.lifecycle == ESPNOW_LIFECYCLE_ACTIVE &&
        ref->session_generation == s_espnow_session.generation &&
        ref->peer_index < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS) {
        peer = &s_espnow_session.peers[ref->peer_index];
        if (!peer->allocated || peer->generation != ref->peer_generation) {
            peer = NULL;
        }
    }
    if (peer == NULL && throw_if_stale) {
        JS_ThrowReferenceError(ctx,
                               "ESPNOW_STALE_PEER: ESP-NOW peer is closed");
    }
    if (out_ref != NULL) {
        *out_ref = ref;
    }
    return peer;
}

