99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
static bool espnow_phy_rate_for_mcs(uint32_t mcs,
                                    bool short_guard_interval,
                                    wifi_phy_rate_t *out_rate)
{
    static const wifi_phy_rate_t long_guard_rates[] = {
        WIFI_PHY_RATE_MCS0_LGI, WIFI_PHY_RATE_MCS1_LGI,
        WIFI_PHY_RATE_MCS2_LGI, WIFI_PHY_RATE_MCS3_LGI,
        WIFI_PHY_RATE_MCS4_LGI, WIFI_PHY_RATE_MCS5_LGI,
        WIFI_PHY_RATE_MCS6_LGI, WIFI_PHY_RATE_MCS7_LGI,
#if CONFIG_SOC_WIFI_HE_SUPPORT
        WIFI_PHY_RATE_MCS8_LGI, WIFI_PHY_RATE_MCS9_LGI,
#endif
    };
    static const wifi_phy_rate_t short_guard_rates[] = {
        WIFI_PHY_RATE_MCS0_SGI, WIFI_PHY_RATE_MCS1_SGI,
        WIFI_PHY_RATE_MCS2_SGI, WIFI_PHY_RATE_MCS3_SGI,
        WIFI_PHY_RATE_MCS4_SGI, WIFI_PHY_RATE_MCS5_SGI,
        WIFI_PHY_RATE_MCS6_SGI, WIFI_PHY_RATE_MCS7_SGI,
#if CONFIG_SOC_WIFI_HE_SUPPORT
        WIFI_PHY_RATE_MCS8_SGI, WIFI_PHY_RATE_MCS9_SGI,
#endif
    };
    const wifi_phy_rate_t *rates = short_guard_interval
                                       ? short_guard_rates
                                       : long_guard_rates;
    size_t count = sizeof(long_guard_rates) / sizeof(long_guard_rates[0]);

    if (out_rate == NULL || mcs >= count) {
        return false;
    }
    *out_rate = rates[mcs];
    return true;
}

static const char *espnow_phy_mode_name(wifi_phy_mode_t phy_mode)
{
    switch (phy_mode) {
    case WIFI_PHY_MODE_HT20:
        return "ht20";
    case WIFI_PHY_MODE_HT40:
        return "ht40";
#if CONFIG_SOC_WIFI_HE_SUPPORT
    case WIFI_PHY_MODE_HE20:
        return "he20";
#endif
    default:
        return "unknown";
    }
}

static esp_err_t espnow_apply_rate_config(
    const uint8_t address[ESPNOW_ADDRESS_BYTES],
    const espnow_peer_rate_config_t *config)
{
    esp_now_rate_config_t native_config;

    if (address == NULL || config == NULL || !config->configured) {
        return ESP_OK;
    }
    memset(&native_config, 0, sizeof(native_config));
    native_config.phymode = config->phy_mode;
    native_config.rate = config->phy_rate;
    native_config.ersu = config->ersu;
    native_config.dcm = config->dcm;
    return esp_now_set_peer_rate_config(address, &native_config);
}

static esp_err_t espnow_apply_peer_rate_config(
    const espnow_peer_slot_t *peer)
{
    if (peer == NULL) {
        return ESP_OK;
    }
    return espnow_apply_rate_config(peer->address, &peer->rate_config);
}

static JSValue espnow_peer_rate_config_to_js(
    JSContext *ctx, const espnow_peer_rate_config_t *config)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    if (config == NULL || !config->configured) {
        *result = JS_NULL;
        return JS_PopGCRef(ctx, &result_ref);
    }
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "phyMode",
            JS_NewString(ctx, espnow_phy_mode_name(config->phy_mode))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "mcs", JS_NewUint32(ctx, config->mcs)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "guardInterval",
            JS_NewString(ctx, config->short_guard_interval
                                  ? "short" : "long")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "ersu", JS_NewBool(config->ersu)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "dcm", JS_NewBool(config->dcm))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static JSValue espnow_peer_status_to_js(JSContext *ctx,
                                        const espnow_peer_slot_t *peer)
{
    char address[18];
    JSGCRef result_ref, rate_config_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *rate_config = JS_PushGCRef(ctx, &rate_config_ref);

    if (peer == NULL) {
        JS_PopGCRef(ctx, &rate_config_ref);
        JS_PopGCRef(ctx, &result_ref);
        return JS_ThrowReferenceError(ctx,
                                      "ESPNOW_STALE_PEER: peer is closed");
    }
    espnow_format_address(peer->address, address);
    *result = JS_NewObject(ctx);
    *rate_config = espnow_peer_rate_config_to_js(ctx, &peer->rate_config);
    if (JS_IsException(*result) ||
        JS_IsException(*rate_config) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "open", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "address",
                                         JS_NewString(ctx, address)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "channel",
            peer->channel == 0
                ? JS_NewString(ctx, "current")
                : JS_NewUint32(ctx, peer->channel)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "encrypted",
                                         JS_NewBool(peer->encrypted)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "rateConfig",
                                         *rate_config)) {
        JS_PopGCRef(ctx, &rate_config_ref);
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &rate_config_ref);
    return JS_PopGCRef(ctx, &result_ref);
}

static JSValue espnow_new_peer_handle(JSContext *ctx,
                                      uint16_t peer_index,
                                      const espnow_peer_slot_t *peer)
{
    espnow_peer_ref_t *ref;
    JSValue object = JS_NewObjectClassUser(ctx, JS_CLASS_ESPNOW_PEER);

    if (JS_IsException(object)) {
        return object;
    }
    ref = esp32_mquickjs_memory_wireless_calloc("espnow", 1, sizeof(*ref), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (ref == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    ref->session_generation = s_espnow_session.generation;
    ref->peer_index = peer_index;
    ref->peer_generation = peer->generation;
    JS_SetOpaque(ctx, object, ref);
    return object;
}

