99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
static void espnow_clear_peer(espnow_peer_slot_t *peer)
{
    if (peer == NULL) {
        return;
    }
    esp32_mquickjs_wireless_secure_zero(peer->lmk, sizeof(peer->lmk));
    memset(peer, 0, sizeof(*peer));
}

static JSValue espnow_throw_error(
    JSContext *ctx,
    const char *code,
    esp_err_t esp_code,
    const uint8_t *address,
    int channel)
{
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    JSValue result;
    char normalized_address[18];

    if (address != NULL) {
        espnow_format_address(address, normalized_address);
    }
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "espCode", JS_NewInt32(ctx, esp_code)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "address",
            address != NULL ? JS_NewString(ctx, normalized_address)
                            : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "channel",
            channel >= 0 ? JS_NewInt32(ctx, channel) : JS_NULL)) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    result = esp32_mquickjs_throw_native_error(
        ctx, code, "espnow", "ESP-NOW operation failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return result;
}

static void espnow_release_rx_slot(espnow_session_t *session,
                                   uint16_t slot_index)
{
    if (session != NULL && slot_index < session->receive_capacity)
        (void)esp32_mquickjs_native_pool_release(&session->rx_free,
                                                    slot_index);
}

static void espnow_receive_event_drop(void *event, void *opaque)
{
    espnow_receive_event_t *receive_event = event;
    espnow_session_t *session = opaque;

    if (receive_event == NULL || session == NULL ||
        receive_event->generation != session->generation) {
        return;
    }
    espnow_release_rx_slot(session, receive_event->slot_index);
}

static JSValue espnow_receive_event_to_js(JSContext *ctx,
                                          const void *event,
                                          void *opaque)
{
    const espnow_receive_event_t *receive_event = event;
    espnow_session_t *session = opaque;
    espnow_rx_slot_t *slot;
    uint8_t *payload = NULL;
    char source_address[18];
    char destination_address[18];
    uint32_t sequence;
    int64_t timestamp_us;
    uint16_t payload_length;
    int8_t rssi;
    uint8_t channel;
    bool broadcast;
    JSGCRef object_ref;
    JSGCRef data_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *data = JS_PushGCRef(ctx, &data_ref);

    *object = JS_UNDEFINED;
    *data = JS_UNDEFINED;
    if (receive_event == NULL || session == NULL ||
        receive_event->generation != session->generation ||
        receive_event->slot_index >= session->receive_capacity ||
        session->rx_slots == NULL) {
        JS_ThrowReferenceError(ctx, "ESPNOW_STALE_SESSION: receive event is stale");
        goto fail;
    }
    slot = &session->rx_slots[receive_event->slot_index];
    if (slot->generation != receive_event->generation ||
        slot->length > session->max_payload_bytes) {
        espnow_release_rx_slot(session, receive_event->slot_index);
        JS_ThrowInternalError(ctx, "ESPNOW_QUEUE_FULL: receive slot is invalid");
        goto fail;
    }
    sequence = slot->sequence;
    timestamp_us = slot->timestamp_us;
    payload_length = slot->length;
    rssi = slot->rssi;
    channel = slot->channel;
    if (payload_length > 0) {
        payload = esp32_mquickjs_memory_wireless_alloc(
        "espnow.rx-copy", payload_length,
            ESP32_MQUICKJS_MEMORY_EXTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_COPY);
        if (payload == NULL) {
            espnow_release_rx_slot(session, receive_event->slot_index);
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
        memcpy(payload, slot->payload, payload_length);
    }
    espnow_format_address(slot->source, source_address);
    espnow_format_address(slot->destination, destination_address);
    broadcast = memcmp(slot->destination, s_broadcast_address,
                       ESPNOW_ADDRESS_BYTES) == 0;
    *data = esp32_mquickjs_new_wireless_owned_byte_view("espnow", ctx, payload, payload_length);
    payload = NULL;
    espnow_release_rx_slot(session, receive_event->slot_index);
    if (JS_IsException(*data)) {
        goto fail;
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "type",
                                         JS_NewString(ctx, "message")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sequence",
                                         JS_NewUint32(ctx, sequence)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "timestampUs",
                                         JS_NewInt64(ctx, timestamp_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sourceAddress",
                                         JS_NewString(ctx, source_address)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "destinationAddress",
                                         JS_NewString(ctx, destination_address)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "broadcast",
                                         JS_NewBool(broadcast)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "rssi",
                                         JS_NewInt32(ctx, rssi)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "channel",
                                         JS_NewInt32(ctx, channel)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "data", *data)) {
        goto fail;
    }
    JS_PopGCRef(ctx, &data_ref);
    return JS_PopGCRef(ctx, &object_ref);

fail:
    esp32_mquickjs_memory_payload_free(payload);
    JS_PopGCRef(ctx, &data_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static void espnow_event_queue_close(void *opaque)
{
    espnow_session_t *session = opaque;

    /* An EventQueue finalizer only requests cleanup. Driver teardown runs at
     * a runtime safe point through the fixed-capacity orphan reaper. */
    if (session != NULL &&
        atomic_load_explicit(&session->lifecycle,
                             memory_order_acquire) !=
            ESPNOW_LIFECYCLE_CLOSING) {
        espnow_request_reap(session);
    }
}

static esp_err_t espnow_channel_admit(espnow_session_t *session, bool refresh)
{
    uint8_t primary;
    wifi_second_chan_t secondary;
    uint32_t generation;
    if (refresh) {
        esp_err_t err = esp32_mquickjs_wifi_radio_get_channel(&primary, &secondary, &generation);
        if (err != ESP_OK) return err;
    }
    esp32_mquickjs_wifi_radio_channel_status_t channel;
    esp_err_t err = esp32_mquickjs_wifi_radio_lease_channel_status(&session->radio_lease, &channel);
    if (err != ESP_OK) return err;
    if (channel.conflicted) return ESP_ERR_ESPNOW_CHAN;
    if (!channel.fixed) {
        atomic_store_explicit(&session->channel, channel.primary, memory_order_release);
        atomic_store_explicit(&session->channel_generation, channel.generation, memory_order_release);
    }
    return ESP_OK;
}

static void espnow_receive_callback(const esp_now_recv_info_t *receive_info,
                                    const uint8_t *data,
                                    int data_length)
{
    espnow_session_t *session = &s_espnow_session;
    espnow_receive_event_t event;
    espnow_rx_slot_t *slot;
    uint16_t slot_index;
    uint32_t generation;
    uint32_t packet_sequence;

