99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
    atomic_fetch_add_explicit(&session->callbacks_active, 1,
                              memory_order_acq_rel);
    generation = session->generation;
    if (session->lifecycle != ESPNOW_LIFECYCLE_ACTIVE ||
        receive_info == NULL || receive_info->src_addr == NULL ||
        receive_info->des_addr == NULL || data == NULL || data_length < 0) {
        if (data_length < 0) {
            atomic_fetch_add_explicit(&session->malformed_packets, 1,
                                      memory_order_relaxed);
        }
        goto done;
    }
    if (espnow_channel_admit(session, false) != ESP_OK) {
        atomic_fetch_add_explicit(&session->dropped_packets, 1, memory_order_relaxed);
        goto done;
    }
    if ((uint32_t)data_length > session->max_payload_bytes) {
        atomic_fetch_add_explicit(&session->malformed_packets, 1,
                                  memory_order_relaxed);
        goto done;
    }
    packet_sequence = atomic_fetch_add_explicit(
                          &session->sequence, 1, memory_order_relaxed) + 1U;
    if (!esp32_mquickjs_native_pool_acquire(&session->rx_free,
                                               &slot_index)) {
        atomic_fetch_add_explicit(&session->dropped_packets, 1,
                                  memory_order_relaxed);
        goto done;
    }
    slot = &session->rx_slots[slot_index];
    slot->generation = session->generation;
    slot->sequence = packet_sequence;
    slot->timestamp_us = esp_timer_get_time();
    memcpy(slot->source, receive_info->src_addr, ESPNOW_ADDRESS_BYTES);
    memcpy(slot->destination, receive_info->des_addr, ESPNOW_ADDRESS_BYTES);
    slot->rssi = receive_info->rx_ctrl != NULL
                     ? receive_info->rx_ctrl->rssi
                     : 0;
    slot->channel = receive_info->rx_ctrl != NULL
                        ? receive_info->rx_ctrl->channel
                        : session->channel;
    slot->length = (uint16_t)data_length;
    if (data_length > 0) {
        memcpy(slot->payload, data, (size_t)data_length);
    }
    event.generation = generation;
    event.slot_index = slot_index;
    if (!esp32_mquickjs_event_queue_try_send_from_callback(
            session->event_queue, &event)) {
        espnow_release_rx_slot(session, slot_index);
        atomic_fetch_add_explicit(&session->dropped_packets, 1,
                                  memory_order_relaxed);
        goto done;
    }
    atomic_fetch_add_explicit(&session->received_packets, 1,
                              memory_order_relaxed);
    atomic_fetch_add_explicit(&session->received_bytes,
                              (uint32_t)data_length, memory_order_relaxed);

done:
    atomic_fetch_sub_explicit(&session->callbacks_active, 1,
                              memory_order_release);
}

static void espnow_send_callback(const esp_now_send_info_t *send_info,
                                 esp_now_send_status_t status)
{
    espnow_session_t *session = &s_espnow_session;
    esp32_mquickjs_future_driver_state_t *state;
    uint32_t queued_slot;
    bool handled = false;

    atomic_fetch_add_explicit(&session->callbacks_active, 1,
                              memory_order_acq_rel);
    state = atomic_load_explicit(&session->active_send,
                                 memory_order_acquire);
    if (send_info != NULL &&
        state != NULL && state->generation == session->generation &&
        state->operation == ESPNOW_OPERATION_SEND &&
        !atomic_load_explicit(&state->completed, memory_order_acquire) &&
        memcmp(state->address, send_info->des_addr,
               ESPNOW_ADDRESS_BYTES) == 0) {
        state->mac_delivered = status == ESP_NOW_SEND_SUCCESS;
        state->completed_at_us = esp_timer_get_time();
        if (status == ESP_NOW_SEND_SUCCESS) {
            atomic_fetch_add_explicit(&session->send_successes, 1,
                                      memory_order_relaxed);
        } else {
            atomic_fetch_add_explicit(&session->send_failures, 1,
                                      memory_order_relaxed);
        }
        atomic_store_explicit(&session->active_send, NULL,
                              memory_order_release);
        atomic_store_explicit(&state->completed, true, memory_order_release);
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
        handled = true;
        espnow_notify_tx_worker(session);
    }
    queued_slot = atomic_load_explicit(&session->active_queued_slot,
                                       memory_order_acquire);
    if (!handled && send_info != NULL && session->tx_packets != NULL &&
        queued_slot < session->tx_queue_capacity &&
        memcmp(session->tx_packets[queued_slot].address,
               send_info->des_addr, ESPNOW_ADDRESS_BYTES) == 0) {
        atomic_store_explicit(&session->queued_send_delivered,
                              status == ESP_NOW_SEND_SUCCESS,
                              memory_order_release);
        atomic_store_explicit(&session->queued_send_error, ESP_OK,
                              memory_order_release);
        atomic_store_explicit(&session->queued_send_completed, true,
                              memory_order_release);
        if (status == ESP_NOW_SEND_SUCCESS) {
            atomic_fetch_add_explicit(&session->send_successes, 1,
                                      memory_order_relaxed);
        } else {
            atomic_fetch_add_explicit(&session->send_failures, 1,
                                      memory_order_relaxed);
        }
        TaskHandle_t tx_task = atomic_load_explicit(
            &session->tx_task, memory_order_acquire);

        if (tx_task != NULL) {
            xTaskNotifyGive(tx_task);
        }
        if (session->runtime != NULL) {
            esp32_mquickjs_notify_activity(session->runtime);
        }
    }
    atomic_fetch_sub_explicit(&session->callbacks_active, 1,
                              memory_order_release);
}

static void espnow_notify_tx_worker(espnow_session_t *session)
{
    TaskHandle_t task;

    if (session == NULL) {
        return;
    }
    task = atomic_load_explicit(&session->tx_task, memory_order_acquire);
    if (task != NULL) {
        xTaskNotifyGive(task);
    }
}

static void espnow_update_tx_high_water(espnow_session_t *session,
                                        uint32_t queued_packets)
{
    uint32_t high_water = atomic_load_explicit(
        &session->tx_high_water_packets, memory_order_relaxed);

    while (queued_packets > high_water &&
           !atomic_compare_exchange_weak_explicit(
               &session->tx_high_water_packets, &high_water,
               queued_packets, memory_order_relaxed,
               memory_order_relaxed)) {
    }
}

static void espnow_complete_queued_send(espnow_session_t *session)
{
    bool batch_completed = false;
    bool delivered;
    int err;

    if (session == NULL ||
        !atomic_load_explicit(&session->queued_send_completed,
                              memory_order_acquire)) {
        return;
    }
    delivered = atomic_load_explicit(&session->queued_send_delivered,
                                     memory_order_acquire);
    err = atomic_load_explicit(&session->queued_send_error,
                               memory_order_acquire);
    portENTER_CRITICAL(&session->lock);
    (void)esp32_mquickjs_espnow_tx_queue_complete_active(
        &session->tx_queue, &batch_completed);
    portEXIT_CRITICAL(&session->lock);
    atomic_store_explicit(&session->active_queued_slot,
                          ESP32_MQUICKJS_ESPNOW_TX_SLOT_NONE,
                          memory_order_release);
    atomic_store_explicit(&session->queued_send_completed, false,
                          memory_order_release);
    atomic_fetch_add_explicit(&session->tx_completed_packets, 1,
                              memory_order_relaxed);
    if (batch_completed) {
        atomic_fetch_add_explicit(&session->tx_completed_batches, 1,
                                  memory_order_relaxed);
    }
    if (err != ESP_OK || !delivered) {
        atomic_fetch_add_explicit(&session->tx_failed_packets, 1,
                                  memory_order_relaxed);
        atomic_store_explicit(&session->tx_last_error,
                              err != ESP_OK ? err : ESP_FAIL,
                              memory_order_relaxed);
    }
    if (session->runtime != NULL) {
        esp32_mquickjs_notify_activity(session->runtime);
    }
}

static void espnow_fail_queued_timeout(espnow_session_t *session)
{
    uint32_t discarded_batches = 0;

    if (session == NULL) {
        return;
    }
    (void)esp32_mquickjs_wireless_tx_timeout(&session->tx_state);
    (void)esp32_mquickjs_wireless_tx_begin_recovery(&session->tx_state);
    atomic_store_explicit(&session->lifecycle, ESPNOW_LIFECYCLE_FAILED,
                          memory_order_release);
    if (session->receive_callback_registered) {
        if (esp_now_unregister_recv_cb() == ESP_OK) session->receive_callback_registered = false;
    }
    if (session->send_callback_registered) {
        if (esp_now_unregister_send_cb() == ESP_OK) session->send_callback_registered = false;
    }
    if (!session->receive_callback_registered && !session->send_callback_registered) {
        while (atomic_load_explicit(&session->callbacks_active,
                                    memory_order_acquire) != 0) {
            vTaskDelay(1);
        }
        if (session->now_initialized) {
            if (esp_now_deinit() == ESP_OK) {
                espnow_note_native_deinit();
                session->now_initialized = false;
                session->broadcast_peer_added = false;
            }
        }
    }
    portENTER_CRITICAL(&session->lock);
    (void)esp32_mquickjs_espnow_tx_queue_complete_active(
        &session->tx_queue, NULL);
    (void)esp32_mquickjs_espnow_tx_queue_discard_pending(
        &session->tx_queue, &discarded_batches);
    portEXIT_CRITICAL(&session->lock);
    atomic_store_explicit(&session->active_queued_slot,
                          ESP32_MQUICKJS_ESPNOW_TX_SLOT_NONE,
                          memory_order_release);
    atomic_store_explicit(&session->queued_send_completed, false,
                          memory_order_release);
    atomic_fetch_add_explicit(&session->send_timeouts, 1,
                              memory_order_relaxed);
    atomic_fetch_add_explicit(&session->send_failures, 1,
                              memory_order_relaxed);
    atomic_fetch_add_explicit(&session->tx_failed_packets, 1,
                              memory_order_relaxed);
    atomic_store_explicit(&session->tx_last_error, ESP_ERR_TIMEOUT,
                          memory_order_relaxed);
    (void)esp32_mquickjs_wireless_tx_finish_recovery(&session->tx_state,
                                                      false);
    if (session->runtime != NULL) {
        esp32_mquickjs_notify_activity(session->runtime);
    }
}

