99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
static bool espnow_start_tracked_send(espnow_session_t *session)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_future_driver_state_t *expected = NULL;

    portENTER_CRITICAL(&session->lock);
    state = atomic_load_explicit(&session->pending_tracked_send,
                                 memory_order_acquire);
    if (state == NULL || !atomic_compare_exchange_strong_explicit(
            &session->active_send, &expected, state,
            memory_order_acq_rel, memory_order_acquire)) {
        portEXIT_CRITICAL(&session->lock);
        return false;
    }
    atomic_store_explicit(&state->submitted, true, memory_order_release);
    expected = state;
    (void)atomic_compare_exchange_strong_explicit(
        &session->pending_tracked_send, &expected, NULL,
        memory_order_acq_rel, memory_order_acquire);
    portEXIT_CRITICAL(&session->lock);
    if (state->payload_length > 0) {
        memcpy(session->tx_staging, state->payload,
               state->payload_length);
    }
    state->err = espnow_channel_admit(session, true);
    if (state->err == ESP_OK)
        state->err = esp_now_send(state->address, session->tx_staging,
                                  state->payload_length);
    if (state->err == ESP_OK) {
        atomic_fetch_add_explicit(&session->sent_packets, 1,
                                  memory_order_relaxed);
        atomic_fetch_add_explicit(&session->sent_bytes,
                                  (uint32_t)state->payload_length,
                                  memory_order_relaxed);
        return true;
    }
    atomic_store_explicit(&session->active_send, NULL,
                          memory_order_release);
    atomic_fetch_add_explicit(&session->send_failures, 1,
                              memory_order_relaxed);
    state->completed_at_us = esp_timer_get_time();
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    return true;
}

static bool espnow_start_queued_send(espnow_session_t *session)
{
    uint16_t slot;
    espnow_tx_packet_t *packet;
    esp_err_t err;

    portENTER_CRITICAL(&session->lock);
    slot = esp32_mquickjs_espnow_tx_queue_start_next(&session->tx_queue);
    portEXIT_CRITICAL(&session->lock);
    if (slot == ESP32_MQUICKJS_ESPNOW_TX_SLOT_NONE) {
        return false;
    }
    packet = &session->tx_packets[slot];
    atomic_store_explicit(&session->active_queued_slot, slot,
                          memory_order_release);
    atomic_store_explicit(&session->queued_send_delivered, false,
                          memory_order_release);
    atomic_store_explicit(&session->queued_send_error, ESP_OK,
                          memory_order_release);
    atomic_store_explicit(&session->queued_send_completed, false,
                          memory_order_release);
    atomic_store_explicit(&session->queued_send_started_us,
                          esp_timer_get_time(), memory_order_release);
    if (packet->length > 0) {
        memcpy(session->tx_staging,
               session->tx_payloads +
                   ((size_t)slot * session->max_payload_bytes),
               packet->length);
    }
    err = espnow_channel_admit(session, true);
    if (err == ESP_OK)
        err = esp_now_send(packet->address, session->tx_staging, packet->length);
    if (err == ESP_OK) {
        atomic_fetch_add_explicit(&session->sent_packets, 1,
                                  memory_order_relaxed);
        atomic_fetch_add_explicit(&session->sent_bytes, packet->length,
                                  memory_order_relaxed);
        return true;
    }
    atomic_fetch_add_explicit(&session->send_failures, 1,
                              memory_order_relaxed);
    atomic_store_explicit(&session->queued_send_error, err,
                          memory_order_release);
    atomic_store_explicit(&session->queued_send_completed, true,
                          memory_order_release);
    return true;
}

static void espnow_tx_worker(void *opaque)
{
    espnow_session_t *session = opaque;

    while (session != NULL) {
        uint32_t active_slot;
        bool stop = atomic_load_explicit(&session->tx_task_stop,
                                         memory_order_acquire);

        if (atomic_load_explicit(&session->queued_send_completed,
                                 memory_order_acquire)) {
            espnow_complete_queued_send(session);
            continue;
        }
        active_slot = atomic_load_explicit(&session->active_queued_slot,
                                           memory_order_acquire);
        if (stop &&
            active_slot == ESP32_MQUICKJS_ESPNOW_TX_SLOT_NONE &&
            atomic_load_explicit(&session->active_send,
                                 memory_order_acquire) == NULL) {
            break;
        }
        if (active_slot != ESP32_MQUICKJS_ESPNOW_TX_SLOT_NONE) {
            int64_t started = atomic_load_explicit(
                &session->queued_send_started_us, memory_order_acquire);
            int64_t elapsed_ms = (esp_timer_get_time() - started) / 1000;

            if (elapsed_ms >= session->send_timeout_ms) {
                espnow_fail_queued_timeout(session);
                continue;
            }
            (void)ulTaskNotifyTake(
                pdTRUE,
                pdMS_TO_TICKS((uint32_t)(session->send_timeout_ms -
                                         elapsed_ms)));
            continue;
        }
        if (session->lifecycle != ESPNOW_LIFECYCLE_ACTIVE ||
            session->tx_state != ESP32_MQUICKJS_WIRELESS_TX_READY) {
            (void)ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(20));
            continue;
        }
        if (atomic_load_explicit(&session->active_send,
                                 memory_order_acquire) != NULL) {
            (void)ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(20));
            continue;
        }
        if (!stop) {
            bool batch_active;

            portENTER_CRITICAL(&session->lock);
            batch_active = session->tx_queue.active_batch_sequence != 0;
            portEXIT_CRITICAL(&session->lock);
            if (!batch_active && espnow_start_tracked_send(session)) {
                continue;
            }
            if (espnow_start_queued_send(session)) {
                continue;
            }
        }
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
    if (session != NULL) {
        atomic_store_explicit(&session->tx_task_exited, true,
                              memory_order_release);
        if (session->runtime != NULL) {
            esp32_mquickjs_notify_activity(session->runtime);
        }
    }
    vTaskSuspend(NULL);
}

