99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
static void espnow_reset_session_storage(espnow_session_t *session)
{
    uint32_t i;

    if (session == NULL) {
        return;
    }
    if (session->event_queue != NULL) {
        (void)esp32_mquickjs_event_queue_discard_all(session->event_queue);
    }
    esp32_mquickjs_memory_payload_free(session->rx_payloads);
    session->rx_payloads = NULL;
    esp32_mquickjs_memory_payload_free(session->rx_slots);
    session->rx_slots = NULL;
    esp32_mquickjs_memory_payload_free(session->tx_payloads);
    session->tx_payloads = NULL;
    esp32_mquickjs_memory_payload_free(session->tx_staging);
    session->tx_staging = NULL;
    esp32_mquickjs_memory_payload_free(session->tx_task_stack);
    session->tx_task_stack = NULL;
    esp32_mquickjs_memory_payload_free(session->tx_packets);
    session->tx_packets = NULL;
    esp32_mquickjs_memory_payload_free(session->tx_links);
    session->tx_links = NULL;
    memset(&session->tx_queue, 0, sizeof(session->tx_queue));
    session->tx_queue_capacity = 0;
    for (i = 0; i < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS; ++i) {
        espnow_peer_slot_t *peer = &session->peers[i];

        espnow_clear_peer(peer);
    }
    session->peer_count = 0;
    session->encrypted_peer_count = 0;
    atomic_store_explicit(&session->active_send, NULL,
                          memory_order_relaxed);
    atomic_store_explicit(&session->pending_tracked_send, NULL,
                          memory_order_relaxed);
    session->tx_state = ESP32_MQUICKJS_WIRELESS_TX_READY;
    atomic_store_explicit(&session->pending_sends, 0,
                          memory_order_relaxed);
    esp32_mquickjs_wireless_secure_zero(session->pmk, sizeof(session->pmk));
    session->has_pmk = false;
    session->event_queue = NULL;
    session->receive_capacity = 0;
    session->max_payload_bytes = 0;
}

static void espnow_begin_close(espnow_session_t *session)
{
    esp32_mquickjs_future_driver_state_t *pending_send;
    uint32_t discarded_batches = 0;

    if (session == NULL ||
        session->lifecycle == ESPNOW_LIFECYCLE_CLOSED ||
        session->lifecycle == ESPNOW_LIFECYCLE_CLOSING) {
        return;
    }
    session->lifecycle = ESPNOW_LIFECYCLE_CLOSING;
    if (session->event_queue != NULL &&
        !esp32_mquickjs_event_queue_is_closed(session->event_queue)) {
        (void)esp32_mquickjs_event_queue_close(session->event_queue);
    }
    portENTER_CRITICAL(&session->lock);
    pending_send = atomic_exchange_explicit(
        &session->pending_tracked_send, NULL, memory_order_acq_rel);
    if (session->tx_queue_capacity > 0) {
        (void)esp32_mquickjs_espnow_tx_queue_discard_pending(
            &session->tx_queue, &discarded_batches);
    }
    portEXIT_CRITICAL(&session->lock);
    if (pending_send != NULL) {
        pending_send->err = ESP_ERR_INVALID_STATE;
        pending_send->completed_at_us = esp_timer_get_time();
        atomic_store_explicit(&pending_send->completed, true,
                              memory_order_release);
        (void)esp32_mquickjs_future_wake(pending_send->runtime,
                                         pending_send->token);
    }
    atomic_store_explicit(&session->tx_task_stop, true,
                          memory_order_release);
    espnow_notify_tx_worker(session);
}

static bool espnow_close_failure(espnow_session_t *session, const char *stage, esp_err_t error)
{
    atomic_store_explicit(&session->cleanup_error, error, memory_order_relaxed);
    atomic_store_explicit(&session->cleanup_stage, stage, memory_order_release);
    return false;
}

/* The interval belongs to Wi-Fi, so ESP-NOW deinit cannot retire its token.
 * Record each window attempt before calling the SDK and retain only the failed
 * cleanup suffix. The caller owns the control lane or the close reservation. */
static esp_err_t espnow_restore_power_save(espnow_session_t *session, const char **stage)
{
    if (session->power_save_cleanup_required && session->close_power_phase == 0U) {
        if (session->now_initialized) {
            *stage = "wake-window-restore";
            esp_err_t err = esp_now_set_wake_window(UINT16_MAX);
            if (err != ESP_OK) return err;
        }
        session->close_power_phase = 1U;
    }
    *stage = "wake-interval-restore";
    esp_err_t err = esp32_mquickjs_wifi_radio_interval_release(
        &session->radio_lease, &session->interval_token);
    if (err != ESP_OK) return err;
    session->power_save_cleanup_required = false;
    session->close_power_phase = 0U;
    return ESP_OK;
}

static esp_err_t espnow_apply_power_save(espnow_session_t *session, bool enabled,
    uint16_t window, uint16_t interval, const char **stage)
{
    if (session->power_save_fault) return ESP_ERR_INVALID_STATE;
    esp_err_t err;
    if (enabled) {
        *stage = "wake-interval-write";
        err = esp32_mquickjs_wifi_radio_interval_configure(
            &session->radio_lease, interval, &session->interval_token);
        if (err != ESP_OK) {
            esp32_mquickjs_wifi_interval_state_t status;
            esp32_mquickjs_wifi_radio_interval_status(&status);
            /* Admission rejection is not an uncertain native write. */
            if (status.uncertain && session->interval_token.identity != 0U &&
                status.owner.identity == session->interval_token.identity)
                session->power_save_fault = true;
            return err;
        }
        session->power_save_cleanup_required = true;
        session->close_power_phase = 0U;
        *stage = "wake-window-write";
        err = esp_now_set_wake_window(window);
    } else {
        /* Explicit disable resets this module's window, never the shared baseline. */
        session->power_save_cleanup_required = true;
        session->close_power_phase = 0U;
        err = espnow_restore_power_save(session, stage);
    }
    if (err != ESP_OK)
        session->power_save_fault = true;
    return err;
}

static bool espnow_finish_close(espnow_session_t *session)
{
    esp32_mquickjs_event_queue_t *event_queue;
    bool event_queue_retained;
    TaskHandle_t tx_task;

    if (session == NULL) {
        return false;
    }
    tx_task = atomic_load_explicit(&session->tx_task,
                                   memory_order_acquire);
    if (tx_task != NULL &&
        !atomic_load_explicit(&session->tx_task_exited,
                              memory_order_acquire)) {
        return espnow_close_failure(session, "tx-worker-drain", ESP_ERR_TIMEOUT);
    }
    if (tx_task != NULL) {
        vTaskDelete(tx_task);
        atomic_store_explicit(&session->tx_task, NULL,
                              memory_order_release);
    }
    if (session->receive_callback_registered) {
        esp_err_t err = esp_now_unregister_recv_cb();
        if (err != ESP_OK) return espnow_close_failure(session, "recv-unregister", err);
        session->receive_callback_registered = false;
    }
    if (session->send_callback_registered) {
        esp_err_t err = esp_now_unregister_send_cb();
        if (err != ESP_OK) return espnow_close_failure(session, "send-unregister", err);
        session->send_callback_registered = false;
    }
    if (
        !esp32_mquickjs_wireless_close_can_release(
            atomic_load_explicit(&session->callbacks_active,
                                 memory_order_acquire),
            true)) {
        return espnow_close_failure(session, "callback-drain", ESP_ERR_TIMEOUT);
    }
    const char *power_stage = NULL;
    esp_err_t power_error = espnow_restore_power_save(session, &power_stage);
    if (power_error != ESP_OK) return espnow_close_failure(session, power_stage, power_error);
    if (session->now_initialized) {
        esp_err_t err = esp_now_deinit();
        if (err != ESP_OK) return espnow_close_failure(session, "esp-now-deinit", err);
        espnow_note_native_deinit();
        session->now_initialized = false;
    }
    session->broadcast_peer_added = false;
    esp32_mquickjs_wifi_radio_release(&session->radio_lease);
    if (session->radio_lease.acquired)
        return espnow_close_failure(session, "radio-release", ESP_ERR_INVALID_STATE);
    event_queue = session->event_queue;
    event_queue_retained = session->event_queue_retained;
    espnow_reset_session_storage(session);
    session->event_queue_retained = false;
    session->runtime = NULL;
    atomic_store_explicit(&session->cleanup_error, ESP_OK, memory_order_relaxed);
    atomic_store_explicit(&session->cleanup_stage, NULL, memory_order_release);
    atomic_store_explicit(&session->lifecycle, ESPNOW_LIFECYCLE_CLOSED,
                          memory_order_release);
    if (event_queue_retained) {
        esp32_mquickjs_event_queue_release(event_queue);
    }
    return true;
}

static void espnow_close_worker(void *opaque)
{
    espnow_session_t *session = opaque;
    if (session == NULL) return;
    /* cleanup_scheduled is held by the submitting path until this worker exits. */
    espnow_begin_close(session);
    while (!atomic_load_explicit(&session->tx_task_exited, memory_order_acquire)) vTaskDelay(1);
    bool closed = espnow_finish_close(session);
    /* Successful unregister fences new callbacks; only the drain suffix waits.
     * SDK errors return once, with restoration/storage still owned for reaping. */
    while (!closed && atomic_load_explicit(&session->cleanup_error, memory_order_acquire) == ESP_ERR_TIMEOUT &&
        strcmp(atomic_load_explicit(&session->cleanup_stage, memory_order_acquire), "callback-drain") == 0) {
        vTaskDelay(1);
        closed = espnow_finish_close(session);
    }
    esp32_mquickjs_future_driver_state_t *close_state = atomic_exchange_explicit(
        &session->active_close, NULL, memory_order_acq_rel);
    if (close_state != NULL) {
        close_state->err = closed ? ESP_OK : atomic_load_explicit(&session->cleanup_error, memory_order_acquire);
        close_state->failed_step = atomic_load_explicit(&session->cleanup_stage, memory_order_acquire);
        close_state->result_bool = closed;
        atomic_store_explicit(&close_state->completed, true, memory_order_release);
    }
    atomic_store_explicit(&session->cleanup_scheduled, false, memory_order_release);
}

static bool espnow_schedule_background_close(espnow_session_t *session)
{
    bool expected = false;

    if (session == NULL || !atomic_compare_exchange_strong_explicit(
            &session->cleanup_scheduled, &expected, true,
            memory_order_acq_rel, memory_order_acquire)) {
        return session != NULL && expected;
    }
    if (esp32_mquickjs_submit_background_worker(
            espnow_close_worker, session)) {
        return true;
    }
    atomic_store_explicit(&session->cleanup_scheduled, false,
                          memory_order_release);
    return false;
}

static void espnow_close_native(espnow_session_t *session)
{
    if (session == NULL || session->lifecycle == ESPNOW_LIFECYCLE_CLOSED ||
        atomic_load_explicit(&session->active_close, memory_order_acquire) != NULL) return;
    bool expected = false;
    if (!atomic_compare_exchange_strong_explicit(&session->cleanup_scheduled, &expected, true,
            memory_order_acq_rel, memory_order_acquire)) return;
    espnow_begin_close(session);
    bool closed = espnow_finish_close(session);
    atomic_store_explicit(&session->cleanup_scheduled, false, memory_order_release);
    if (closed) return;
    espnow_request_reap(session);
    if (!espnow_schedule_background_close(session))
        ESP_LOGE(TAG, "ESP-NOW cleanup is pending because the worker queue is full");
}

