99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
static bool espnow_reap(void *opaque)
{
    espnow_session_t *session = opaque;

    if (session == NULL ||
        atomic_load_explicit(&session->lifecycle,
                             memory_order_acquire) ==
            ESPNOW_LIFECYCLE_CLOSED) {
        if (session != NULL) session->reaper_registered = false;
        return true;
    }
    espnow_close_native(session);
    if (atomic_load_explicit(&session->lifecycle,
                             memory_order_acquire) ==
        ESPNOW_LIFECYCLE_CLOSED) {
        session->reaper_registered = false;
        return true;
    }
    return false;
}

static void espnow_request_reap(espnow_session_t *session)
{
    if (session == NULL || session->runtime == NULL ||
        atomic_load_explicit(&session->lifecycle,
                             memory_order_acquire) ==
            ESPNOW_LIFECYCLE_CLOSED) {
        return;
    }
    if (!session->reaper_registered) {
        session->reaper_registered = esp32_mquickjs_register_reaper(
            session->runtime, espnow_reap, session);
        if (!session->reaper_registered) {
            ESP_LOGE(TAG,
                     "ESP-NOW orphan cleanup registry is full");
        }
    }
    esp32_mquickjs_notify_activity(session->runtime);
}

static bool espnow_allocate_receive_pool(JSContext *ctx,
                                         espnow_session_t *session,
                                         uint32_t capacity,
                                         uint32_t max_payload_bytes)
{
    uint32_t i;

    session->rx_slots = esp32_mquickjs_memory_wireless_calloc(
        "espnow.rx-pool", capacity, sizeof(*session->rx_slots),
        ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_POOL);
    session->rx_payloads = esp32_mquickjs_memory_wireless_calloc(
        "espnow.rx-pool", capacity, max_payload_bytes,
        ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_POOL);
    if (session->rx_slots == NULL || session->rx_payloads == NULL ||
        !esp32_mquickjs_native_pool_init(&session->rx_free, capacity)) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    session->receive_capacity = capacity;
    session->max_payload_bytes = max_payload_bytes;
    for (i = 0; i < capacity; ++i) {
        session->rx_slots[i].payload =
            session->rx_payloads + ((size_t)i * max_payload_bytes);
    }
    return true;
}

static bool espnow_allocate_tx_queue(
    JSContext *ctx,
    espnow_session_t *session,
    uint16_t capacity,
    uint32_t max_payload_bytes,
    esp32_mquickjs_espnow_tx_overflow_t overflow)
{
    if (capacity == 0) {
        session->tx_staging = esp32_mquickjs_memory_wireless_alloc(
        "espnow.tx-staging", max_payload_bytes,
            ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_TX);
        session->tx_task_stack = esp32_mquickjs_memory_wireless_alloc(
        "espnow.tx-task-stack", ESPNOW_TX_TASK_STACK_BYTES,
            ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_STACK);
        if (session->tx_staging == NULL || session->tx_task_stack == NULL) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        return true;
    }
    session->tx_links = esp32_mquickjs_memory_wireless_calloc(
        "espnow.tx-queue", capacity, sizeof(*session->tx_links),
        ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_QUEUE);
    session->tx_packets = esp32_mquickjs_memory_wireless_calloc(
        "espnow.tx-queue", capacity, sizeof(*session->tx_packets),
        ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_QUEUE);
    session->tx_payloads = esp32_mquickjs_memory_wireless_alloc(
        "espnow.tx-queue", (size_t)capacity * max_payload_bytes,
        ESP32_MQUICKJS_MEMORY_EXTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_QUEUE);
    session->tx_staging = esp32_mquickjs_memory_wireless_alloc(
        "espnow.tx-staging", max_payload_bytes,
        ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_TX);
    session->tx_task_stack = esp32_mquickjs_memory_wireless_alloc(
        "espnow.tx-task-stack", ESPNOW_TX_TASK_STACK_BYTES,
        ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_STACK);
    if (session->tx_links == NULL || session->tx_packets == NULL ||
        session->tx_payloads == NULL || session->tx_staging == NULL ||
        session->tx_task_stack == NULL ||
        !esp32_mquickjs_espnow_tx_queue_init(
            &session->tx_queue, session->tx_links, capacity)) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    session->tx_queue_capacity = capacity;
    session->tx_overflow = overflow;
    return true;
}

static bool espnow_parse_power_save(
    JSContext *ctx,
    JSValue value,
    esp32_mquickjs_future_driver_state_t *state)
{
    static const char *const allowed[] = {
        "enabled", "wakeWindowMs", "wakeIntervalMs",
    };
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    uint32_t window;
    uint32_t interval;
    bool enabled = true;
    bool result = false;

    if (!espnow_is_object(ctx, value) ||
        !espnow_validate_option_keys(ctx, value, "espNow.open({ powerSave })",
                                     allowed, 3)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx,
                              "espNow.open({ powerSave }) expects an options object");
        }
        goto done;
    }
    *property = JS_GetPropertyStr(ctx, value, "enabled");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (!JS_IsBool(*property)) {
            JS_ThrowTypeError(ctx, "powerSave.enabled must be a boolean");
            goto done;
        }
        enabled = *property == JS_TRUE;
    }
    *property = JS_GetPropertyStr(ctx, value, "wakeWindowMs");
    if (!enabled) {
        if (JS_IsException(*property)) {
            goto done;
        }
        if (!JS_IsUndefined(*property)) {
            JS_ThrowTypeError(
                ctx, "disabled powerSave must not include wakeWindowMs");
            goto done;
        }
        *property = JS_GetPropertyStr(ctx, value, "wakeIntervalMs");
        if (JS_IsException(*property)) {
            goto done;
        }
        if (!JS_IsUndefined(*property)) {
            JS_ThrowTypeError(
                ctx, "disabled powerSave must not include wakeIntervalMs");
            goto done;
        }
        state->power_save_enabled = false;
        state->wake_window_ms = 0;
        state->wake_interval_ms = 0;
        result = true;
        goto done;
    }
    if (JS_IsException(*property) || !espnow_to_u32(ctx, *property, &window) ||
        window == 0 || window > UINT16_MAX) {
        JS_ThrowRangeError(ctx, "wakeWindowMs must be in the range 1..65535");
        goto done;
    }
    *property = JS_GetPropertyStr(ctx, value, "wakeIntervalMs");
    if (JS_IsException(*property) || !espnow_to_u32(ctx, *property, &interval) ||
        interval == 0 || interval > UINT16_MAX || window > interval) {
        JS_ThrowRangeError(
            ctx, "wakeIntervalMs must be in the range wakeWindowMs..65535");
        goto done;
    }
    state->power_save_enabled = true;
    state->wake_window_ms = (uint16_t)window;
    state->wake_interval_ms = (uint16_t)interval;
    result = true;

done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

