99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
static bool espnow_parse_tx_queue(
    JSContext *ctx,
    JSValue value,
    esp32_mquickjs_future_driver_state_t *state)
{
    static const char *const allowed[] = {
        "capacityPackets", "overflow",
    };
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    uint32_t capacity;
    bool result = false;

    if (state == NULL || !espnow_is_object(ctx, value) ||
        !espnow_validate_option_keys(ctx, value, "espNow.open({ txQueue })",
                                     allowed, 2U)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx,
                              "espNow.open({ txQueue }) expects an options object");
        }
        goto done;
    }
    *property = JS_GetPropertyStr(ctx, value, "capacityPackets");
    if (JS_IsException(*property) ||
        !espnow_to_u32(ctx, *property, &capacity) || capacity == 0 ||
        capacity > CONFIG_ESP32_MQUICKJS_ESPNOW_TX_MAX_QUEUE_LEN) {
        if (!JS_HasException(ctx)) {
            JS_ThrowRangeError(
                ctx, "txQueue.capacityPackets exceeds this Build Context");
        }
        goto done;
    }
    state->tx_queue_capacity = (uint16_t)capacity;
    state->tx_overflow = ESP32_MQUICKJS_ESPNOW_TX_REJECT_NEWEST;
    *property = JS_GetPropertyStr(ctx, value, "overflow");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (espnow_string_equals(ctx, *property, "reject-newest")) {
            state->tx_overflow = ESP32_MQUICKJS_ESPNOW_TX_REJECT_NEWEST;
        } else if (espnow_string_equals(ctx, *property,
                                        "drop-oldest-batch")) {
            state->tx_overflow =
                ESP32_MQUICKJS_ESPNOW_TX_DROP_OLDEST_BATCH;
        } else {
            JS_ThrowTypeError(
                ctx,
                "txQueue.overflow must be 'reject-newest' or 'drop-oldest-batch'");
            goto done;
        }
    }
    result = true;

done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

static bool espnow_parse_open_options(
    JSContext *ctx,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t *state)
{
    static const char *const allowed[] = {
        "interface", "channel", "maxPayloadBytes", "receiveCapacity",
        "sendTimeoutMs", "pmk", "powerSave", "broadcastRateConfig",
        "txQueue",
    };
    JSGCRef property_ref;
    JSValue *property;
    JSValue options = JS_UNDEFINED;
    uint32_t raw;

    state->max_payload_bytes =
        CONFIG_ESP32_MQUICKJS_ESPNOW_DEFAULT_MAX_PAYLOAD_BYTES;
    state->receive_capacity = CONFIG_ESP32_MQUICKJS_ESPNOW_RX_QUEUE_LEN;
    state->send_timeout_ms =
        CONFIG_ESP32_MQUICKJS_ESPNOW_DEFAULT_SEND_TIMEOUT_MS;
    if (argc > 1) {
        JS_ThrowTypeError(ctx, "espNow.open(options?) accepts at most one argument");
        return false;
    }
    if (argc == 0 || JS_IsUndefined(argv[0].val)) {
        return true;
    }
    options = argv[0].val;
    if (!espnow_is_object(ctx, options)) {
        JS_ThrowTypeError(ctx, "espNow.open(options?) expects an options object");
        return false;
    }
    if (!espnow_validate_option_keys(ctx, options, "espNow.open()", allowed, 9)) {
        return false;
    }

    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, options, "interface");
    if (JS_IsException(*property) ||
        (!JS_IsUndefined(*property) &&
         !espnow_string_equals(ctx, *property, "station"))) {
        JS_ThrowTypeError(ctx, "espNow.open({ interface }) only supports 'station'");
        goto fail;
    }
    *property = JS_GetPropertyStr(ctx, options, "channel");
    if (JS_IsException(*property)) {
        goto fail;
    }
    if (!JS_IsUndefined(*property) &&
        !espnow_string_equals(ctx, *property, "current")) {
        if (!espnow_to_u32(ctx, *property, &raw) || raw < 1 || raw > 14) {
            JS_ThrowRangeError(ctx,
                               "espNow.open({ channel }) expects 'current' or 1..14");
            goto fail;
        }
        state->channel_fixed = true;
        state->channel = (uint8_t)raw;
    }
    *property = JS_GetPropertyStr(ctx, options, "maxPayloadBytes");
    if (JS_IsException(*property)) {
        goto fail;
    }
    if (!JS_IsUndefined(*property)) {
        if (!espnow_to_u32(ctx, *property, &raw) || raw == 0 ||
            raw > CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PAYLOAD_BYTES ||
            (!ESPNOW_V2_PAYLOAD_ENABLED &&
             raw > ESP_NOW_MAX_DATA_LEN)) {
            JS_ThrowRangeError(ctx, "maxPayloadBytes exceeds this Build Context");
            goto fail;
        }
        state->max_payload_bytes = raw;
    }
    *property = JS_GetPropertyStr(ctx, options, "receiveCapacity");
    if (JS_IsException(*property)) {
        goto fail;
    }
    if (!JS_IsUndefined(*property)) {
        if (!espnow_to_u32(ctx, *property, &raw) || raw == 0 ||
            raw > CONFIG_ESP32_MQUICKJS_ESPNOW_RX_MAX_QUEUE_LEN ||
            raw > UINT16_MAX) {
            JS_ThrowRangeError(ctx, "receiveCapacity exceeds this Build Context");
            goto fail;
        }
        state->receive_capacity = raw;
    }
    *property = JS_GetPropertyStr(ctx, options, "sendTimeoutMs");
    if (JS_IsException(*property)) {
        goto fail;
    }
    if (!JS_IsUndefined(*property)) {
        if (!espnow_to_u32(ctx, *property, &raw) || raw == 0 || raw > 60000) {
            JS_ThrowRangeError(ctx, "sendTimeoutMs must be in the range 1..60000");
            goto fail;
        }
        state->send_timeout_ms = raw;
    }
    *property = JS_GetPropertyStr(ctx, options, "pmk");
    if (JS_IsException(*property)) {
        goto fail;
    }
    if (!JS_IsUndefined(*property)) {
        esp32_mquickjs_byte_source_t source;
        uint8_t *owned = NULL;
        JSValue error = JS_UNDEFINED;

        if (!esp32_mquickjs_get_wireless_byte_source("espnow",
                ctx, *property, "espNow.open({ pmk })", &source, &owned,
                &error)) {
            goto fail;
        }
        if (!esp32_mquickjs_wireless_key_length_valid(source.length,
                                                       ESP_NOW_KEY_LEN)) {
            if (owned != NULL) {
                esp32_mquickjs_wireless_secure_zero(owned, source.length);
            }
            esp32_mquickjs_release_byte_source(owned);
            JS_ThrowRangeError(ctx, "ESPNOW_INVALID_KEY: PMK must be exactly 16 bytes");
            goto fail;
        }
        memcpy(state->pmk, source.data, ESP_NOW_KEY_LEN);
        if (owned != NULL) {
            esp32_mquickjs_wireless_secure_zero(owned, source.length);
        }
        esp32_mquickjs_release_byte_source(owned);
        state->has_pmk = true;
    }
    *property = JS_GetPropertyStr(ctx, options, "powerSave");
    if (JS_IsException(*property) ||
        (!JS_IsUndefined(*property) &&
         !espnow_parse_power_save(ctx, *property, state))) {
        goto fail;
    }
    *property = JS_GetPropertyStr(ctx, options, "broadcastRateConfig");
    if (JS_IsException(*property) ||
        (!JS_IsUndefined(*property) &&
         !espnow_parse_rate_config(
             ctx, *property, "espNow.open({ broadcastRateConfig })",
             &state->broadcast_rate_config))) {
        goto fail;
    }
    *property = JS_GetPropertyStr(ctx, options, "txQueue");
    if (JS_IsException(*property) ||
        (!JS_IsUndefined(*property) &&
         !espnow_parse_tx_queue(ctx, *property, state))) {
        goto fail;
    }
    JS_PopGCRef(ctx, &property_ref);
    return true;

