99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
fail:
    JS_PopGCRef(ctx, &property_ref);
    return false;
}

static void espnow_open_release(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    if (!state->transferred &&
        s_espnow_session.generation == state->generation) {
        espnow_close_native(&s_espnow_session);
    }
    if (state->event_queue_rooted) {
        if (!state->transferred) {
            (void)esp32_mquickjs_event_queue_dispose(
                state->ctx, state->event_queue_ref.val);
        }
        JS_DeleteGCRef(state->ctx, &state->event_queue_ref);
        state->event_queue_rooted = false;
    }
    esp32_mquickjs_wireless_secure_zero(state->pmk, sizeof(state->pmk));
}

static bool espnow_closed_and_quiescent(const espnow_session_t *session)
{
    return session != NULL && session->lifecycle == ESPNOW_LIFECYCLE_CLOSED &&
        !atomic_load_explicit(&session->cleanup_scheduled, memory_order_acquire) &&
        atomic_load_explicit(&session->active_close, memory_order_acquire) == NULL &&
        !session->reaper_registered;
}

static bool espnow_open_capture(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    espnow_session_t *session = &s_espnow_session;
    JSValue event_queue;
    uint32_t generation;

    (void)this_ref;
    if (out_state == NULL) {
        return false;
    }
    *out_state = NULL;
    if (!espnow_closed_and_quiescent(session)) {
        JS_ThrowReferenceError(ctx, "ESPNOW_ALREADY_OPEN: an ESP-NOW session already exists");
        return false;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    atomic_init(&state->completed, false);
    if (!espnow_parse_open_options(ctx, argc, argv, state)) {
        esp32_mquickjs_wireless_secure_zero(state->pmk, sizeof(state->pmk));
        esp32_mquickjs_memory_payload_free(state);
        return false;
    }
    /* Option getters can execute JS and change the singleton after preflight. */
    if (!espnow_closed_and_quiescent(session)) {
        esp32_mquickjs_wireless_secure_zero(state->pmk, sizeof(state->pmk));
        esp32_mquickjs_memory_payload_free(state);
        JS_ThrowReferenceError(ctx, "ESPNOW_ALREADY_OPEN: session changed during option capture");
        return false;
    }
    generation = atomic_fetch_add_explicit(
        &s_espnow_next_generation, 1, memory_order_relaxed);
    if (generation == 0) {
        generation = atomic_fetch_add_explicit(
            &s_espnow_next_generation, 1, memory_order_relaxed);
    }
    memset(session, 0, sizeof(*session));
    session->lock = (portMUX_TYPE)portMUX_INITIALIZER_UNLOCKED;
    atomic_init(&session->lifecycle, ESPNOW_LIFECYCLE_OPENING);
    session->runtime = esp32_mquickjs_get_active_runtime();
    atomic_init(&session->generation, generation);
    session->send_timeout_ms = state->send_timeout_ms;
    session->channel_fixed = state->channel_fixed;
    session->channel = state->channel;
    session->broadcast_rate_config = state->broadcast_rate_config;
    session->has_pmk = state->has_pmk;
    session->power_save_enabled = state->power_save_enabled;
    session->wake_window_ms = state->wake_window_ms;
    session->wake_interval_ms = state->wake_interval_ms;
    atomic_init(&session->active_send, NULL);
    atomic_init(&session->pending_tracked_send, NULL);
    atomic_init(&session->pending_sends, 0);
    atomic_init(&session->tx_task_stop, false);
    atomic_init(&session->tx_task_exited, true);
    atomic_init(&session->tx_task, NULL);
    atomic_init(&session->active_queued_slot,
                ESP32_MQUICKJS_ESPNOW_TX_SLOT_NONE);
    atomic_init(&session->queued_send_completed, false);
    atomic_init(&session->queued_send_delivered, false);
    atomic_init(&session->queued_send_error, ESP_OK);
    atomic_init(&session->queued_send_started_us, 0);
    atomic_init(&session->next_batch_sequence, 1);
    atomic_init(&session->tx_accepted_batches, 0);
    atomic_init(&session->tx_accepted_packets, 0);
    atomic_init(&session->tx_rejected_batches, 0);
    atomic_init(&session->tx_rejected_packets, 0);
    atomic_init(&session->tx_evicted_batches, 0);
    atomic_init(&session->tx_evicted_packets, 0);
    atomic_init(&session->tx_completed_batches, 0);
    atomic_init(&session->tx_completed_packets, 0);
    atomic_init(&session->tx_failed_packets, 0);
    atomic_init(&session->tx_high_water_packets, 0);
    atomic_init(&session->tx_last_error, ESP_OK);
    atomic_init(&session->callbacks_active, 0);
    atomic_init(&session->cleanup_scheduled, false);
    atomic_init(&session->cleanup_error, ESP_OK);
    atomic_init(&session->cleanup_stage, NULL);
    atomic_init(&session->active_close, NULL);
    atomic_init(&session->sequence, 0);
    atomic_init(&session->received_packets, 0);
    atomic_init(&session->received_bytes, 0);
    atomic_init(&session->dropped_packets, 0);
    atomic_init(&session->malformed_packets, 0);
    atomic_init(&session->sent_packets, 0);
    atomic_init(&session->sent_bytes, 0);
    atomic_init(&session->send_successes, 0);
    atomic_init(&session->send_failures, 0);
    atomic_init(&session->send_timeouts, 0);
    if (state->has_pmk) {
        memcpy(session->pmk, state->pmk, ESP_NOW_KEY_LEN);
    }
    state->generation = generation;

    if (!espnow_allocate_receive_pool(
            ctx, session, state->receive_capacity,
            state->max_payload_bytes)) {
        espnow_open_release(state);
        esp32_mquickjs_memory_payload_free(state);
        return false;
    }
    if (!espnow_allocate_tx_queue(
            ctx, session, state->tx_queue_capacity,
            state->max_payload_bytes, state->tx_overflow)) {
        espnow_open_release(state);
        esp32_mquickjs_memory_payload_free(state);
        return false;
    }
    event_queue = esp32_mquickjs_event_queue_new_wireless("espnow",
        ctx, session->runtime, sizeof(espnow_receive_event_t),
        state->receive_capacity, ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST,
        espnow_receive_event_to_js, espnow_receive_event_drop,
        espnow_event_queue_close, session);
    if (JS_IsException(event_queue)) {
        espnow_open_release(state);
        esp32_mquickjs_memory_payload_free(state);
        return false;
    }
    *JS_AddGCRef(ctx, &state->event_queue_ref) = event_queue;
    state->event_queue_rooted = true;
    session->event_queue = esp32_mquickjs_event_queue_from_value(
        ctx, event_queue);
    if (session->event_queue == NULL ||
        !esp32_mquickjs_event_queue_retain(session->event_queue)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowInternalError(ctx, "failed to retain ESP-NOW event queue");
        }
        espnow_open_release(state);
        esp32_mquickjs_memory_payload_free(state);
        return false;
    }
    session->event_queue_retained = true;
    if (esp32_mquickjs_wifi_radio_acquire(
            ESP32_MQUICKJS_WIFI_RADIO_CLIENT_ESPNOW, WIFI_MODE_STA,
            &session->radio_lease) != ESP_OK) {
        if (!JS_HasException(ctx)) {
            JS_ThrowInternalError(ctx, "failed to reserve ESP-NOW radio resources");
        }
        espnow_open_release(state);
        esp32_mquickjs_memory_payload_free(state);
        return false;
    }
    *out_state = state;
    return true;
}

static void espnow_open_initialize(
    esp32_mquickjs_future_driver_state_t *state)
{
    espnow_session_t *session = &s_espnow_session;
    wifi_second_chan_t secondary;
    esp_now_peer_info_t broadcast_peer = {0};
    uint8_t actual_channel = 0;
    uint32_t actual_generation = 0;

