99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
    if (state == NULL || state->open_initialization_started) {
        return;
    }
    state->open_initialization_started = true;
    if (session->generation != state->generation ||
        session->lifecycle != ESPNOW_LIFECYCLE_OPENING) {
        state->failed_step = "open_reservation";
        state->err = ESP_ERR_INVALID_STATE;
        goto complete;
    }
    state->failed_step = "wifi_radio_ensure_started";
    state->err = esp32_mquickjs_wifi_radio_ensure_started(
        &session->radio_lease);
    if (state->err == ESP_OK && state->channel_fixed) {
        state->failed_step = "wifi_radio_set_channel";
        state->err = esp32_mquickjs_wifi_radio_set_channel(
            &session->radio_lease, state->channel, WIFI_SECOND_CHAN_NONE);
    }
    if (state->err == ESP_OK) {
        state->failed_step = "wifi_radio_get_channel";
        state->err = esp32_mquickjs_wifi_radio_get_channel(
            &actual_channel, &secondary, &actual_generation);
        if (state->err == ESP_OK) {
            session->channel = actual_channel;
            session->channel_generation = actual_generation;
        }
    }
    if (state->err == ESP_OK) {
        state->failed_step = "esp_now_init";
        state->err = esp_now_init();
        session->now_initialized = state->err == ESP_OK;
    }
    if (state->err == ESP_OK) {
        state->failed_step = "esp_now_register_recv_cb";
        state->err = esp_now_register_recv_cb(espnow_receive_callback);
        session->receive_callback_registered = state->err == ESP_OK;
    }
    if (state->err == ESP_OK) {
        state->failed_step = "esp_now_register_send_cb";
        state->err = esp_now_register_send_cb(espnow_send_callback);
        session->send_callback_registered = state->err == ESP_OK;
    }
    if (state->err == ESP_OK && session->has_pmk) {
        state->failed_step = "esp_now_set_pmk";
        state->err = esp_now_set_pmk(session->pmk);
    }
    if (state->err == ESP_OK) {
        memcpy(broadcast_peer.peer_addr, s_broadcast_address,
               ESPNOW_ADDRESS_BYTES);
        broadcast_peer.channel = 0;
        broadcast_peer.ifidx = WIFI_IF_STA;
        broadcast_peer.encrypt = false;
        state->failed_step = "esp_now_add_broadcast_peer";
        state->err = esp_now_add_peer(&broadcast_peer);
        session->broadcast_peer_added = state->err == ESP_OK;
    }
    if (state->err == ESP_OK) {
        state->failed_step = "esp_now_set_broadcast_rate_config";
        state->err = espnow_apply_rate_config(
            s_broadcast_address, &session->broadcast_rate_config);
    }
    if (state->err == ESP_OK && session->power_save_enabled) {
        state->err = espnow_apply_power_save(session, true,
            session->wake_window_ms, session->wake_interval_ms, &state->failed_step);
    }
    if (state->err == ESP_OK) {
        TaskHandle_t tx_task = NULL;

        state->failed_step = "espnow_tx_worker";
        atomic_store_explicit(&session->tx_task_exited, false,
                              memory_order_release);
        tx_task = xTaskCreateStatic(
            espnow_tx_worker, "espnow_tx", ESPNOW_TX_TASK_STACK_BYTES,
            session, tskIDLE_PRIORITY + 2, session->tx_task_stack,
            &session->tx_task_buffer);
        if (tx_task == NULL) {
            atomic_store_explicit(&session->tx_task_exited, true,
                                  memory_order_release);
            state->err = ESP_ERR_NO_MEM;
        } else {
            atomic_store_explicit(&session->tx_task, tx_task,
                                  memory_order_release);
        }
    }
    if (state->err == ESP_OK) {
        state->failed_step = "wifi_radio_confirm_channel";
        state->err = esp32_mquickjs_wifi_radio_get_channel(
            &actual_channel, &secondary, &actual_generation);
        if (state->err == ESP_OK && state->channel_fixed &&
            actual_channel != state->channel) {
            state->err = ESP_ERR_ESPNOW_CHAN;
        }
        if (state->err == ESP_OK) {
            session->channel = actual_channel;
            session->channel_generation = actual_generation;
        }
    }
    if (state->err != ESP_OK) {
        session->lifecycle = ESPNOW_LIFECYCLE_FAILED;
        ESP_LOGE(TAG, "open failed at %s: %s (0x%x)",
                 state->failed_step != NULL ? state->failed_step : "unknown",
                 esp_err_to_name(state->err), (unsigned int)state->err);
    } else {
        state->failed_step = NULL;
        session->lifecycle = ESPNOW_LIFECYCLE_ACTIVE;
    }

complete:
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(state->runtime, state->token);
}

static bool espnow_open_start(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    espnow_session_t *session = &s_espnow_session;

    if (state == NULL || session->generation != state->generation ||
        session->lifecycle != ESPNOW_LIFECYCLE_OPENING) {
        JS_ThrowReferenceError(ctx,
                               "ESPNOW_STALE_SESSION: open reservation is stale");
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    state->open_not_before_us = s_espnow_reopen_not_before_us;
    if (esp_timer_get_time() >= state->open_not_before_us) {
        espnow_open_initialize(state);
    }
    return true;
}

static esp32_mquickjs_future_poll_t espnow_open_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && state->started &&
        !state->open_initialization_started &&
        esp_timer_get_time() >= state->open_not_before_us) {
        espnow_open_initialize(state);
    }
    return state != NULL && atomic_load_explicit(
                                &state->completed, memory_order_acquire)
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue espnow_open_finish(
    JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state)
{
    espnow_session_ref_t *ref;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    *object = JS_UNDEFINED;
    if (state != NULL && state->err != ESP_OK) {
        espnow_throw_error(ctx, "ESPNOW_NOT_OPEN", state->err, NULL,
                           s_espnow_session.channel > 0
                               ? (int)s_espnow_session.channel : -1);
        goto fail;
    }
    if (state == NULL || state->cancelled ||
        s_espnow_session.generation != state->generation ||
        s_espnow_session.lifecycle != ESPNOW_LIFECYCLE_ACTIVE) {
        JS_ThrowReferenceError(ctx, "ESPNOW_NOT_OPEN: ESP-NOW open was cancelled");
        goto fail;
    }
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_ESPNOW_SESSION);
    if (JS_IsException(*object)) {
        goto fail;
    }
    ref = esp32_mquickjs_memory_wireless_calloc("espnow", 1, sizeof(*ref), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    ref->generation = state->generation;
    JS_SetOpaque(ctx, *object, ref);
    if (!esp32_mquickjs_set_property_ref(
            ctx, object, "_eventQueue", state->event_queue_ref.val)) {
        JS_SetOpaque(ctx, *object, NULL);
        esp32_mquickjs_memory_payload_free(ref);
        goto fail;
    }
    state->transferred = true;
    esp32_mquickjs_wireless_secure_zero(state->pmk, sizeof(state->pmk));
    return JS_PopGCRef(ctx, &object_ref);

