99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
fail:
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static esp32_mquickjs_cancel_result_t espnow_open_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->started) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    state->cancelled = true;
    atomic_store_explicit(&state->completed, true, memory_order_release);
    return ESP32_MQUICKJS_CANCELLED;
}

static void espnow_open_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    espnow_open_release(state);
    esp32_mquickjs_memory_payload_free(state);
}

static esp32_mquickjs_resource_key_t espnow_open_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    (void)state;
    return esp32_mquickjs_wifi_radio_channel_key();
}

static const esp32_mquickjs_future_driver_t s_espnow_open_driver = {
    .memory_owner = "wireless.future", .capture = espnow_open_capture,
    .start = espnow_open_start,
    .poll = espnow_open_poll,
    .finish = espnow_open_finish,
    .cancel = espnow_open_cancel,
    .destroy = espnow_open_destroy,
    .resource_key = espnow_open_resource_key,
};

static espnow_session_t *espnow_session_from_value(
    JSContext *ctx,
    JSValue value,
    bool throw_if_stale)
{
    espnow_session_ref_t *ref;

    if (JS_GetClassID(ctx, value) != JS_CLASS_ESPNOW_SESSION ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected an EspNowSession instance");
        return NULL;
    }
    if ((s_espnow_session.lifecycle != ESPNOW_LIFECYCLE_ACTIVE &&
         s_espnow_session.lifecycle != ESPNOW_LIFECYCLE_FAILED) ||
        ref->generation != s_espnow_session.generation) {
        if (throw_if_stale) {
            JS_ThrowReferenceError(ctx,
                                   "ESPNOW_STALE_SESSION: ESP-NOW session is closed");
        }
        return NULL;
    }
    return &s_espnow_session;
}

static bool espnow_retain_owner(
    JSContext *ctx,
    JSValue owner,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return false;
    }
    *JS_AddGCRef(ctx, &state->owner_ref) = owner;
    state->owner_rooted = true;
    return true;
}

static bool espnow_parse_rate_config(
    JSContext *ctx, JSValue value, const char *operation,
    espnow_peer_rate_config_t *out_config)
{
    static const char *const allowed[] = {
        "phyMode", "mcs", "guardInterval", "ersu", "dcm",
    };
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    espnow_peer_rate_config_t config = {0};
    uint32_t mcs;
    bool result = false;

    if (out_config == NULL || !espnow_is_object(ctx, value) ||
        !espnow_validate_option_keys(ctx, value, operation, allowed, 5U)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(
                ctx, "ESPNOW_INVALID_RATE_CONFIG: rateConfig must be an object");
        }
        goto done;
    }

    *property = JS_GetPropertyStr(ctx, value, "phyMode");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (espnow_string_equals(ctx, *property, "ht20")) {
        config.phy_mode = WIFI_PHY_MODE_HT20;
    } else if (espnow_string_equals(ctx, *property, "ht40")) {
        config.phy_mode = WIFI_PHY_MODE_HT40;
#if CONFIG_SOC_WIFI_HE_SUPPORT
    } else if (espnow_string_equals(ctx, *property, "he20")) {
        config.phy_mode = WIFI_PHY_MODE_HE20;
#endif
    } else {
        JS_ThrowTypeError(
            ctx,
            "ESPNOW_INVALID_RATE_CONFIG: phyMode must be ht20, ht40%s",
#if CONFIG_SOC_WIFI_HE_SUPPORT
            ", or he20"
#else
            ""
#endif
        );
        goto done;
    }

    *property = JS_GetPropertyStr(ctx, value, "mcs");
    if (JS_IsException(*property) || !espnow_to_u32(ctx, *property, &mcs) ||
        mcs > (config.phy_mode == WIFI_PHY_MODE_HE20 ? 9U : 7U) ||
        !espnow_phy_rate_for_mcs(mcs, false, &config.phy_rate)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(
                ctx,
                "ESPNOW_INVALID_RATE_CONFIG: mcs must be 0..7 for HT or 0..9 for HE");
        }
        goto done;
    }
    config.mcs = (uint8_t)mcs;

    *property = JS_GetPropertyStr(ctx, value, "guardInterval");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (espnow_string_equals(ctx, *property, "long")) {
        config.short_guard_interval = false;
    } else if (espnow_string_equals(ctx, *property, "short")) {
        config.short_guard_interval = true;
        if (!espnow_phy_rate_for_mcs(mcs, true, &config.phy_rate)) {
            JS_ThrowTypeError(ctx,
                              "ESPNOW_INVALID_RATE_CONFIG: unsupported MCS");
            goto done;
        }
    } else {
        JS_ThrowTypeError(
            ctx,
            "ESPNOW_INVALID_RATE_CONFIG: guardInterval must be long or short");
        goto done;
    }

    *property = JS_GetPropertyStr(ctx, value, "ersu");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (*property != JS_TRUE && *property != JS_FALSE) {
            JS_ThrowTypeError(
                ctx, "ESPNOW_INVALID_RATE_CONFIG: ersu must be a boolean");
            goto done;
        }
        config.ersu = *property == JS_TRUE;
    }

    *property = JS_GetPropertyStr(ctx, value, "dcm");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (*property != JS_TRUE && *property != JS_FALSE) {
            JS_ThrowTypeError(
                ctx, "ESPNOW_INVALID_RATE_CONFIG: dcm must be a boolean");
            goto done;
        }
        config.dcm = *property == JS_TRUE;
    }
    if (config.phy_mode != WIFI_PHY_MODE_HE20 &&
        (config.ersu || config.dcm)) {
        JS_ThrowTypeError(
            ctx,
            "ESPNOW_INVALID_RATE_CONFIG: ersu and dcm require HE20");
        goto done;
    }

    config.configured = true;
    *out_config = config;
    result = true;

done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

static bool espnow_parse_peer_options(
    JSContext *ctx,
    JSValue options,
    bool updating,
    const espnow_peer_slot_t *existing,
    esp32_mquickjs_future_driver_state_t *state)
{
    static const char *const add_allowed[] = {
        "address", "channel", "encrypted", "lmk", "rateConfig",
    };
    static const char *const update_allowed[] = {
        "channel", "encrypted", "lmk",
    };
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    uint32_t raw;
    bool result = false;

    if (!espnow_is_object(ctx, options) ||
        !espnow_validate_option_keys(
            ctx, options, updating ? "EspNowPeer.update()"
                                   : "EspNowSession.addPeer()",
            updating ? update_allowed : add_allowed,
            updating ? 3U : 5U)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "ESP-NOW peer options must be an object");
        }
        goto done;
    }
    if (updating) {
        memcpy(state->address, existing->address, ESPNOW_ADDRESS_BYTES);
        state->peer_channel = existing->channel;
        state->encrypted = existing->encrypted;
        state->has_lmk = existing->encrypted;
        if (existing->encrypted) {
            memcpy(state->lmk, existing->lmk, ESP_NOW_KEY_LEN);
        }
    } else {
        *property = JS_GetPropertyStr(ctx, options, "address");
        if (JS_IsException(*property) ||
            !espnow_parse_address(ctx, *property,
                                  "EspNowSession.addPeer({ address })", false,
                                  state->address)) {
            goto done;
        }
    }
    *property = JS_GetPropertyStr(ctx, options, "channel");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (espnow_string_equals(ctx, *property, "current")) {
            state->peer_channel = 0;
        } else if (!espnow_to_u32(ctx, *property, &raw) || raw < 1 ||
                   raw > 14 || raw != s_espnow_session.channel) {
            espnow_throw_error(ctx, "ESPNOW_CHANNEL_MISMATCH",
                               ESP_ERR_ESPNOW_CHAN, state->address,
                               (int)s_espnow_session.channel);
            goto done;
        } else {
            state->peer_channel = (uint8_t)raw;
        }
    }
    *property = JS_GetPropertyStr(ctx, options, "encrypted");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (*property != JS_TRUE && *property != JS_FALSE) {
            JS_ThrowTypeError(ctx, "encrypted must be a boolean");
            goto done;
        }
        state->encrypted = *property == JS_TRUE;
        if (!state->encrypted) {
            esp32_mquickjs_wireless_secure_zero(state->lmk,
                                                 sizeof(state->lmk));
            state->has_lmk = false;
        }
    }
    *property = JS_GetPropertyStr(ctx, options, "lmk");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        esp32_mquickjs_byte_source_t source;
        uint8_t *owned = NULL;
        JSValue error = JS_UNDEFINED;

        if (!esp32_mquickjs_get_wireless_byte_source("espnow",
                ctx, *property, "ESP-NOW LMK", &source, &owned, &error)) {
            goto done;
        }
        if (!esp32_mquickjs_wireless_key_length_valid(source.length,
                                                       ESP_NOW_KEY_LEN)) {
            if (owned != NULL) {
                esp32_mquickjs_wireless_secure_zero(owned, source.length);
            }
            esp32_mquickjs_release_byte_source(owned);
            espnow_throw_error(ctx, "ESPNOW_INVALID_KEY", ESP_ERR_INVALID_ARG,
                               state->address, s_espnow_session.channel);
            goto done;
        }
        memcpy(state->lmk, source.data, ESP_NOW_KEY_LEN);
        if (owned != NULL) {
            esp32_mquickjs_wireless_secure_zero(owned, source.length);
        }
        esp32_mquickjs_release_byte_source(owned);
        state->has_lmk = true;
    }
    if (state->encrypted &&
        (!s_espnow_session.has_pmk || !state->has_lmk)) {
        espnow_throw_error(ctx, "ESPNOW_INVALID_KEY", ESP_ERR_INVALID_ARG,
                           state->address, s_espnow_session.channel);
        goto done;
    }
    if (!state->encrypted && state->has_lmk) {
        espnow_throw_error(ctx, "ESPNOW_INVALID_KEY", ESP_ERR_INVALID_ARG,
                           state->address, s_espnow_session.channel);
        goto done;
    }
    if (!updating) {
        *property = JS_GetPropertyStr(ctx, options, "rateConfig");
        if (JS_IsException(*property) ||
            (!JS_IsUndefined(*property) &&
             !espnow_parse_rate_config(
                 ctx, *property,
                 "EspNowSession.addPeer({ rateConfig })",
                 &state->peer_rate_config))) {
            goto done;
        }
    }
    result = true;

done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

static bool espnow_peer_add_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    espnow_peer_slot_t *slot = NULL;
    uint16_t i;
    uint32_t peer_generation;

