99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
    if (out_state == NULL || argc != 1 ||
        espnow_session_from_value(ctx, this_ref->val, true) == NULL) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx,
                              "EspNowSession.addPeer(options) expects one options object");
        }
        return false;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = ESPNOW_OPERATION_ADD_PEER;
    state->generation = s_espnow_session.generation;
    atomic_init(&state->completed, false);
    if (!espnow_parse_peer_options(ctx, argv[0].val, false, NULL, state)) {
        goto fail;
    }
    if (espnow_find_peer_by_address(
            &s_espnow_session, state->address, NULL) != NULL) {
        espnow_throw_error(ctx, "ESPNOW_PEER_TABLE_FULL",
                           ESP_ERR_ESPNOW_EXIST, state->address,
                           s_espnow_session.channel);
        goto fail;
    }
    if (state->encrypted &&
        s_espnow_session.encrypted_peer_count >=
            CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM) {
        espnow_throw_error(ctx, "ESPNOW_ENCRYPTED_PEER_LIMIT",
                           ESP_ERR_ESPNOW_FULL, state->address,
                           s_espnow_session.channel);
        goto fail;
    }
    for (i = 0; i < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS; ++i) {
        if (!s_espnow_session.peers[i].allocated &&
            !s_espnow_session.peers[i].reserved) {
            slot = &s_espnow_session.peers[i];
            state->peer_index = i;
            break;
        }
    }
    if (slot == NULL) {
        espnow_throw_error(ctx, "ESPNOW_PEER_TABLE_FULL",
                           ESP_ERR_ESPNOW_FULL, state->address,
                           s_espnow_session.channel);
        goto fail;
    }
    peer_generation = atomic_fetch_add_explicit(
        &s_espnow_next_peer_generation, 1, memory_order_relaxed);
    if (peer_generation == 0) {
        peer_generation = atomic_fetch_add_explicit(
            &s_espnow_next_peer_generation, 1, memory_order_relaxed);
    }
    slot->reserved = true;
    slot->generation = peer_generation;
    state->peer_generation = peer_generation;
    state->peer_reserved = true;
    espnow_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;

fail:
    esp32_mquickjs_wireless_secure_zero(state->lmk, sizeof(state->lmk));
    esp32_mquickjs_memory_payload_free(state);
    return false;
}

static bool espnow_peer_update_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    espnow_peer_ref_t *ref = NULL;
    espnow_peer_slot_t *peer;

    if (out_state == NULL || argc != 1 ||
        (peer = espnow_peer_from_value(
             ctx, this_ref->val, &ref, true)) == NULL) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx,
                              "EspNowPeer.update(options) expects one options object");
        }
        return false;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = ESPNOW_OPERATION_UPDATE_PEER;
    state->generation = ref->session_generation;
    state->peer_index = ref->peer_index;
    state->peer_generation = ref->peer_generation;
    atomic_init(&state->completed, false);
    if (!espnow_parse_peer_options(
            ctx, argv[0].val, true, peer, state)) {
        esp32_mquickjs_wireless_secure_zero(state->lmk, sizeof(state->lmk));
        esp32_mquickjs_memory_payload_free(state);
        return false;
    }
    if (!peer->encrypted && state->encrypted &&
        s_espnow_session.encrypted_peer_count >=
            CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM) {
        esp32_mquickjs_wireless_secure_zero(state->lmk, sizeof(state->lmk));
        esp32_mquickjs_memory_payload_free(state);
        espnow_throw_error(ctx, "ESPNOW_ENCRYPTED_PEER_LIMIT",
                           ESP_ERR_ESPNOW_FULL, peer->address,
                           s_espnow_session.channel);
        return false;
    }
    espnow_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool espnow_peer_remove_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    espnow_peer_ref_t *ref = NULL;
    espnow_peer_slot_t *peer;

    (void)argv;
    if (out_state == NULL || argc != 0) {
        JS_ThrowTypeError(ctx, "EspNowPeer.remove() expects no arguments");
        return false;
    }
    peer = espnow_peer_from_value(ctx, this_ref->val, &ref, true);
    if (peer == NULL) {
        return false;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = ESPNOW_OPERATION_CLOSE_PEER;
    state->generation = ref->session_generation;
    state->peer_index = ref->peer_index;
    state->peer_generation = ref->peer_generation;
    memcpy(state->address, peer->address, ESPNOW_ADDRESS_BYTES);
    atomic_init(&state->completed, false);
    espnow_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool espnow_power_save_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;

