99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
    if (out_state == NULL || argc != 1 ||
        espnow_session_from_value(ctx, this_ref->val, true) == NULL) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx,
                              "EspNowSession.setPowerSave(options) expects one options object");
        }
        return false;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = ESPNOW_OPERATION_SET_POWER_SAVE;
    state->generation = s_espnow_session.generation;
    atomic_init(&state->completed, false);
    if (!espnow_parse_power_save(ctx, argv[0].val, state)) {
        esp32_mquickjs_memory_payload_free(state);
        return false;
    }
    espnow_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool espnow_session_close_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    espnow_session_ref_t *ref;

    (void)argv;
    if (out_state == NULL || argc != 0 ||
        JS_GetClassID(ctx, this_ref->val) != JS_CLASS_ESPNOW_SESSION ||
        (ref = JS_GetOpaque(ctx, this_ref->val)) == NULL) {
        JS_ThrowTypeError(ctx, "EspNowSession.close() expects no arguments");
        return false;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = ESPNOW_OPERATION_CLOSE_SESSION;
    state->generation = ref->generation;
    state->result_bool = ref->generation == s_espnow_session.generation &&
                         (s_espnow_session.lifecycle == ESPNOW_LIFECYCLE_ACTIVE ||
                          s_espnow_session.lifecycle == ESPNOW_LIFECYCLE_FAILED ||
                          s_espnow_session.lifecycle == ESPNOW_LIFECYCLE_CLOSING);
    atomic_init(&state->completed, false);
    *JS_AddGCRef(ctx, &state->event_queue_ref) =
        JS_GetPropertyStr(ctx, this_ref->val, "_eventQueue");
    state->event_queue_rooted = true;
    if (JS_IsException(state->event_queue_ref.val) ||
        JS_GetClassID(ctx, state->event_queue_ref.val) !=
            JS_CLASS_EVENT_QUEUE) {
        JS_DeleteGCRef(ctx, &state->event_queue_ref);
        esp32_mquickjs_memory_payload_free(state);
        if (!JS_HasException(ctx)) {
            JS_ThrowInternalError(ctx,
                                  "ESP-NOW session event queue is unavailable");
        }
        return false;
    }
    espnow_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool espnow_control_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    espnow_session_t *session = &s_espnow_session;
    espnow_peer_slot_t *peer = NULL;
    esp_now_peer_info_t peer_info = {0};

    if (state == NULL) {
        JS_ThrowInternalError(ctx, "ESP-NOW control state is missing");
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (state->operation != ESPNOW_OPERATION_CLOSE_SESSION &&
        (session->lifecycle != ESPNOW_LIFECYCLE_ACTIVE ||
         state->generation != session->generation)) {
        espnow_throw_error(ctx, "ESPNOW_NOT_OPEN",
                           ESP_ERR_ESPNOW_NOT_INIT, NULL, -1);
        return false;
    }
    switch (state->operation) {
    case ESPNOW_OPERATION_ADD_PEER:
        peer = state->peer_index < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS
                   ? &session->peers[state->peer_index]
                   : NULL;
        if (peer == NULL || !peer->reserved ||
            peer->generation != state->peer_generation) {
            espnow_throw_error(ctx, "ESPNOW_STALE_PEER",
                               ESP_ERR_INVALID_STATE, state->address,
                               session->channel);
            return false;
        }
        memcpy(peer_info.peer_addr, state->address, ESPNOW_ADDRESS_BYTES);
        peer_info.channel = state->peer_channel;
        peer_info.ifidx = WIFI_IF_STA;
        peer_info.encrypt = state->encrypted;
        if (state->encrypted) {
            memcpy(peer_info.lmk, state->lmk, ESP_NOW_KEY_LEN);
        }
        state->err = esp_now_add_peer(&peer_info);
        if (state->err == ESP_OK) {
            memcpy(peer->address, state->address, ESPNOW_ADDRESS_BYTES);
            peer->channel = state->peer_channel;
            peer->encrypted = state->encrypted;
            peer->rate_config = state->peer_rate_config;
            if (state->encrypted) {
                memcpy(peer->lmk, state->lmk, ESP_NOW_KEY_LEN);
            }
            state->err = espnow_apply_peer_rate_config(peer);
            if (state->err != ESP_OK) {
                (void)esp_now_del_peer(peer->address);
                espnow_clear_peer(peer);
                state->peer_reserved = false;
            } else {
                peer->allocated = true;
                peer->reserved = false;
                state->peer_reserved = false;
                session->peer_count++;
                if (peer->encrypted) {
                    session->encrypted_peer_count++;
                }
            }
        }
        break;
    case ESPNOW_OPERATION_UPDATE_PEER:
        peer = state->peer_index < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS
                   ? &session->peers[state->peer_index]
                   : NULL;
        if (peer == NULL || !peer->allocated ||
            peer->generation != state->peer_generation) {
            espnow_throw_error(ctx, "ESPNOW_STALE_PEER",
                               ESP_ERR_INVALID_STATE, state->address,
                               session->channel);
            return false;
        }
        {
            esp_now_peer_info_t previous_peer_info = {0};

