99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
            memcpy(previous_peer_info.peer_addr, peer->address,
                   ESPNOW_ADDRESS_BYTES);
            previous_peer_info.channel = peer->channel;
            previous_peer_info.ifidx = WIFI_IF_STA;
            previous_peer_info.encrypt = peer->encrypted;
            if (peer->encrypted) {
                memcpy(previous_peer_info.lmk, peer->lmk, ESP_NOW_KEY_LEN);
            }
            memcpy(peer_info.peer_addr, state->address,
                   ESPNOW_ADDRESS_BYTES);
            peer_info.channel = state->peer_channel;
            peer_info.ifidx = WIFI_IF_STA;
            peer_info.encrypt = state->encrypted;
            if (state->encrypted) {
                memcpy(peer_info.lmk, state->lmk, ESP_NOW_KEY_LEN);
            }
            state->err = esp_now_mod_peer(&peer_info);
            if (state->err == ESP_OK) {
                state->err = espnow_apply_peer_rate_config(peer);
                if (state->err == ESP_OK) {
                    if (peer->encrypted != state->encrypted) {
                        if (state->encrypted) {
                            session->encrypted_peer_count++;
                        } else if (session->encrypted_peer_count > 0) {
                            session->encrypted_peer_count--;
                        }
                    }
                    esp32_mquickjs_wireless_secure_zero(
                        peer->lmk, sizeof(peer->lmk));
                    peer->channel = state->peer_channel;
                    peer->encrypted = state->encrypted;
                    if (state->encrypted) {
                        memcpy(peer->lmk, state->lmk, ESP_NOW_KEY_LEN);
                    }
                } else {
                    esp_err_t update_err = state->err;

                    if (esp_now_mod_peer(&previous_peer_info) == ESP_OK) {
                        (void)espnow_apply_peer_rate_config(peer);
                    }
                    state->err = update_err;
                }
            }
            esp32_mquickjs_wireless_secure_zero(
                previous_peer_info.lmk, sizeof(previous_peer_info.lmk));
        }
        break;
    case ESPNOW_OPERATION_CLOSE_PEER:
        peer = state->peer_index < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS
                   ? &session->peers[state->peer_index]
                   : NULL;
        if (peer == NULL || !peer->allocated ||
            peer->generation != state->peer_generation) {
            state->result_bool = false;
            state->err = ESP_OK;
            break;
        }
        state->err = esp_now_del_peer(peer->address);
        if (state->err == ESP_OK || state->err == ESP_ERR_ESPNOW_NOT_FOUND) {
            if (peer->encrypted && session->encrypted_peer_count > 0) {
                session->encrypted_peer_count--;
            }
            if (session->peer_count > 0) {
                session->peer_count--;
            }
            espnow_clear_peer(peer);
            state->result_bool = true;
            state->err = ESP_OK;
        }
        break;
    case ESPNOW_OPERATION_SET_POWER_SAVE:
        state->err = espnow_apply_power_save(session, state->power_save_enabled,
            state->wake_window_ms, state->wake_interval_ms, &state->failed_step);
        if (session->power_save_fault) {
            session->lifecycle = ESPNOW_LIFECYCLE_FAILED;
            espnow_notify_tx_worker(session);
        }
        if (state->err == ESP_OK) {
            session->power_save_enabled = state->power_save_enabled;
            session->wake_window_ms = state->wake_window_ms;
            session->wake_interval_ms = state->wake_interval_ms;
            state->result_bool = true;
        }
        break;
    case ESPNOW_OPERATION_CLOSE_SESSION:
        if (state->result_bool) {
            bool expected = false;
            if (!atomic_compare_exchange_strong_explicit(&session->cleanup_scheduled, &expected, true,
                    memory_order_acq_rel, memory_order_acquire)) {
                espnow_request_reap(session);
                espnow_throw_error(ctx, "ESPNOW_CLEANUP_PENDING", ESP_ERR_INVALID_STATE, NULL, -1);
                return false;
            }
            atomic_store_explicit(&session->active_close, state, memory_order_release);
            espnow_begin_close(session);
            if (!esp32_mquickjs_future_submit_worker(runtime, token, espnow_close_worker, session)) {
                atomic_store_explicit(&session->active_close, NULL, memory_order_release);
                atomic_store_explicit(&session->cleanup_scheduled, false, memory_order_release);
                espnow_request_reap(session);
                espnow_throw_error(ctx, "ESPNOW_CLEANUP_PENDING", ESP_ERR_NO_MEM, NULL, -1);
                return false;
            }
            return true;
        }
        state->err = ESP_OK;
        break;
    default:
        JS_ThrowInternalError(ctx, "invalid ESP-NOW control operation");
        return false;
    }
    if (state->err != ESP_OK) {
        const char *code = "ESPNOW_SEND_FAILED";

        if (state->operation == ESPNOW_OPERATION_ADD_PEER &&
            (state->err == ESP_ERR_ESPNOW_FULL ||
             state->err == ESP_ERR_ESPNOW_EXIST)) {
            code = "ESPNOW_PEER_TABLE_FULL";
        } else if ((state->operation == ESPNOW_OPERATION_UPDATE_PEER ||
                    state->operation == ESPNOW_OPERATION_CLOSE_PEER) &&
                   state->err == ESP_ERR_ESPNOW_NOT_FOUND) {
            code = "ESPNOW_PEER_NOT_FOUND";
        } else if (state->operation == ESPNOW_OPERATION_SET_POWER_SAVE) {
            code = "ESPNOW_POWER_SAVE_FAILED";
        }
        espnow_throw_error(ctx, code, state->err,
                           state->address, session->channel);
        return false;
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static esp32_mquickjs_future_poll_t espnow_control_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL && atomic_load_explicit(
                                &state->completed, memory_order_acquire)
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue espnow_control_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    espnow_peer_slot_t *peer;

    if (state == NULL || state->cancelled) {
        return JS_ThrowInternalError(ctx, "ESP-NOW control operation cancelled");
    }
    if (state->operation == ESPNOW_OPERATION_CLOSE_SESSION && state->err != ESP_OK) {
        if (state->generation == s_espnow_session.generation) espnow_request_reap(&s_espnow_session);
        return espnow_throw_error(ctx, "ESPNOW_CLEANUP_PENDING", state->err, NULL, -1);
    }
    if (state->operation == ESPNOW_OPERATION_ADD_PEER) {
        peer = state->peer_index < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS
                   ? &s_espnow_session.peers[state->peer_index]
                   : NULL;
        if (peer == NULL || !peer->allocated ||
            peer->generation != state->peer_generation) {
            return espnow_throw_error(ctx, "ESPNOW_STALE_PEER",
                                      ESP_ERR_INVALID_STATE, state->address,
                                      s_espnow_session.channel);
        }
        return espnow_new_peer_handle(ctx, state->peer_index, peer);
    }
    if (state->operation == ESPNOW_OPERATION_UPDATE_PEER) {
        peer = state->peer_index < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS
                   ? &s_espnow_session.peers[state->peer_index]
                   : NULL;
        return espnow_peer_status_to_js(ctx, peer);
    }
    return JS_NewBool(state->result_bool);
}

static esp32_mquickjs_cancel_result_t espnow_control_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->started) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    state->cancelled = true;
    atomic_store_explicit(&state->completed, true, memory_order_release);
    return ESP32_MQUICKJS_CANCELLED;
}

static void espnow_control_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    if (state->peer_reserved &&
        state->generation == s_espnow_session.generation &&
        state->peer_index < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS) {
        espnow_peer_slot_t *peer = &s_espnow_session.peers[state->peer_index];

        if (peer->reserved && peer->generation == state->peer_generation) {
            espnow_clear_peer(peer);
        }
    }
    bool close_finished = state->operation == ESPNOW_OPERATION_CLOSE_SESSION &&
        (state->generation != s_espnow_session.generation ||
         s_espnow_session.lifecycle == ESPNOW_LIFECYCLE_CLOSED);
    if (state->operation == ESPNOW_OPERATION_CLOSE_SESSION && !close_finished)
        espnow_request_reap(&s_espnow_session);
    if (state->event_queue_rooted) {
        if (close_finished) {
            (void)esp32_mquickjs_event_queue_dispose(
                state->ctx, state->event_queue_ref.val);
        }
        JS_DeleteGCRef(state->ctx, &state->event_queue_ref);
        state->event_queue_rooted = false;
    }
    if (state->owner_rooted) {
        if (close_finished) {
            espnow_retire_handle(state->ctx, state->owner_ref.val,
                                 JS_CLASS_ESPNOW_SESSION,
                                 &s_espnow_closed_session_ref);
        } else if (state->operation == ESPNOW_OPERATION_CLOSE_PEER &&
                   state->result_bool) {
            espnow_retire_handle(state->ctx, state->owner_ref.val,
                                 JS_CLASS_ESPNOW_PEER,
                                 &s_espnow_closed_peer_ref);
        }
        JS_DeleteGCRef(state->ctx, &state->owner_ref);
        state->owner_rooted = false;
    }
    esp32_mquickjs_wireless_secure_zero(state->lmk, sizeof(state->lmk));
    esp32_mquickjs_memory_payload_free(state);
}

static esp32_mquickjs_resource_key_t espnow_control_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && state->operation == ESPNOW_OPERATION_CLOSE_SESSION) {
        return &s_espnow_tx_lane_key;
    }
    return &s_espnow_control_lane_key;
}

