99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
static uint32_t espnow_close_timeout_ms(
    const esp32_mquickjs_future_driver_state_t *state)
{
    (void)state;
    return ESPNOW_CLOSE_TIMEOUT_MS;
}

static JSValue espnow_close_on_timeout(
    JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state,
    uint32_t timeout_ms)
{
    (void)state;
    (void)timeout_ms;
    return espnow_throw_error(
        ctx, "ESPNOW_CLEANUP_PENDING", ESP_ERR_TIMEOUT, NULL, -1);
}

static const esp32_mquickjs_future_driver_t s_espnow_peer_add_driver = {
    .memory_owner = "wireless.future", .capture = espnow_peer_add_capture,
    .start = espnow_control_start,
    .poll = espnow_control_poll,
    .finish = espnow_control_finish,
    .cancel = espnow_control_cancel,
    .destroy = espnow_control_destroy,
    .resource_key = espnow_control_resource_key,
};

static const esp32_mquickjs_future_driver_t s_espnow_peer_update_driver = {
    .memory_owner = "wireless.future", .capture = espnow_peer_update_capture,
    .start = espnow_control_start,
    .poll = espnow_control_poll,
    .finish = espnow_control_finish,
    .cancel = espnow_control_cancel,
    .destroy = espnow_control_destroy,
    .resource_key = espnow_control_resource_key,
};

static const esp32_mquickjs_future_driver_t s_espnow_peer_remove_driver = {
    .memory_owner = "wireless.future", .capture = espnow_peer_remove_capture,
    .start = espnow_control_start,
    .poll = espnow_control_poll,
    .finish = espnow_control_finish,
    .cancel = espnow_control_cancel,
    .destroy = espnow_control_destroy,
    .resource_key = espnow_control_resource_key,
};

static const esp32_mquickjs_future_driver_t s_espnow_power_save_driver = {
    .memory_owner = "wireless.future", .capture = espnow_power_save_capture,
    .start = espnow_control_start,
    .poll = espnow_control_poll,
    .finish = espnow_control_finish,
    .cancel = espnow_control_cancel,
    .destroy = espnow_control_destroy,
    .resource_key = espnow_control_resource_key,
};

static const esp32_mquickjs_future_driver_t s_espnow_session_close_driver = {
    .memory_owner = "wireless.future", .capture = espnow_session_close_capture,
    .start = espnow_control_start,
    .poll = espnow_control_poll,
    .finish = espnow_control_finish,
    .cancel = espnow_control_cancel,
    .destroy = espnow_control_destroy,
    .timeout_ms = espnow_close_timeout_ms,
    .on_timeout = espnow_close_on_timeout,
    .resource_key = espnow_control_resource_key,
};

static bool espnow_parse_send_timeout(
    JSContext *ctx,
    JSValue options,
    uint32_t *timeout_ms)
{
    static const char *const allowed[] = {"timeoutMs"};
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool result = false;

    if (JS_IsUndefined(options)) {
        result = true;
        goto done;
    }
    if (!espnow_is_object(ctx, options) ||
        !espnow_validate_option_keys(ctx, options, "ESP-NOW send()",
                                     allowed, 1)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "ESP-NOW send options must be an object");
        }
        goto done;
    }
    *property = JS_GetPropertyStr(ctx, options, "timeoutMs");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(
                ctx, *property, 1U, 60000U, timeout_ms)) {
            JS_ThrowRangeError(ctx, "timeoutMs must be in the range 1..60000");
            goto done;
        }
    }
    result = true;

done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

static bool espnow_send_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    espnow_peer_ref_t *peer_ref = NULL;
    espnow_peer_slot_t *peer = NULL;
    espnow_session_t *session = NULL;
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    uint8_t actual_channel;
    wifi_second_chan_t secondary;
    uint32_t channel_generation;

    if (out_state == NULL || argc < 1 || argc > 2) {
        JS_ThrowTypeError(ctx, "ESP-NOW send(data, options?) expects one ByteSource");
        return false;
    }
    if (JS_GetClassID(ctx, this_ref->val) == JS_CLASS_ESPNOW_PEER) {
        peer = espnow_peer_from_value(ctx, this_ref->val, &peer_ref, true);
        if (peer == NULL) {
            return false;
        }
        session = &s_espnow_session;
    } else if (JS_GetClassID(ctx, this_ref->val) == JS_CLASS_ESPNOW_SESSION) {
        session = espnow_session_from_value(ctx, this_ref->val, true);
        if (session == NULL) {
            return false;
        }
    } else {
        JS_ThrowTypeError(ctx,
                          "ESP-NOW send requires an EspNowPeer or EspNowSession receiver");
        return false;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = ESPNOW_OPERATION_SEND;
    state->generation = session->generation;
    state->send_timeout_ms = session->send_timeout_ms;
    atomic_init(&state->completed, false);
    atomic_init(&state->recovery_pending, false);
    atomic_init(&state->recovery_worker_submitted, false);
    atomic_init(&state->submitted, false);
    if (peer != NULL) {
        state->peer_index = peer_ref->peer_index;
        state->peer_generation = peer_ref->peer_generation;
        state->peer_channel = peer->channel;
        memcpy(state->address, peer->address, ESPNOW_ADDRESS_BYTES);
    } else {
        memcpy(state->address, s_broadcast_address, ESPNOW_ADDRESS_BYTES);
    }
    if (!espnow_parse_send_timeout(
            ctx, argc == 2 ? argv[1].val : JS_UNDEFINED,
            &state->send_timeout_ms)) {
        goto fail;
    }
    if (!esp32_mquickjs_get_wireless_byte_source("espnow",
            ctx, argv[0].val, "ESP-NOW send(data)", &source, &owned,
            &error)) {
        goto fail;
    }
    if (source.length > session->max_payload_bytes) {
        esp32_mquickjs_release_byte_source(owned);
        owned = NULL;
        espnow_throw_error(ctx, "ESPNOW_PAYLOAD_TOO_LARGE",
                           ESP_ERR_ESPNOW_ARG, state->address,
                           session->channel);
        goto fail;
    }
    state->payload = esp32_mquickjs_memory_wireless_alloc(
        "espnow.tx-tracked", source.length > 0 ? source.length : 1U,
        ESP32_MQUICKJS_MEMORY_EXTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_TX);
    if (state->payload == NULL) {
        esp32_mquickjs_release_byte_source(owned);
        owned = NULL;
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    state->payload_length = source.length;
    if (source.length > 0) {
        memcpy(state->payload, source.data, source.length);
    }
    esp32_mquickjs_release_byte_source(owned);
    owned = NULL;
    if (espnow_channel_admit(session, true) != ESP_OK ||
        esp32_mquickjs_wifi_radio_get_channel(
            &actual_channel, &secondary, &channel_generation) != ESP_OK ||
        actual_channel != session->channel ||
        channel_generation != session->channel_generation ||
        (state->peer_channel != 0 &&
         state->peer_channel != actual_channel)) {
        espnow_throw_error(ctx, "ESPNOW_CHANNEL_MISMATCH",
                           ESP_ERR_ESPNOW_CHAN, state->address,
                           session->channel);
        goto fail;
    }
    espnow_retain_owner(ctx, this_ref->val, state);
    atomic_fetch_add_explicit(&session->pending_sends, 1,
                              memory_order_relaxed);
    state->send_reserved = true;
    *out_state = state;
    return true;

