99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
fail:
    esp32_mquickjs_release_byte_source(owned);
    esp32_mquickjs_memory_payload_free(state->payload);
    esp32_mquickjs_memory_payload_free(state);
    return false;
}

static bool espnow_send_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    espnow_session_t *session = &s_espnow_session;
    esp32_mquickjs_future_driver_state_t *expected = NULL;

    if (state == NULL || state->generation != session->generation ||
        session->lifecycle != ESPNOW_LIFECYCLE_ACTIVE) {
        espnow_throw_error(ctx, "ESPNOW_NOT_OPEN",
                           ESP_ERR_ESPNOW_NOT_INIT,
                           state != NULL ? state->address : NULL, -1);
        return false;
    }
    if (session->tx_state != ESP32_MQUICKJS_WIRELESS_TX_READY) {
        espnow_throw_error(ctx, "ESPNOW_CLOSING", ESP_ERR_INVALID_STATE,
                           state->address, session->channel);
        return false;
    }
    if (state->peer_generation != 0) {
        espnow_peer_slot_t *peer =
            state->peer_index < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS
                ? &session->peers[state->peer_index]
                : NULL;

        if (peer == NULL || !peer->allocated ||
            peer->generation != state->peer_generation) {
            espnow_throw_error(ctx, "ESPNOW_STALE_PEER",
                               ESP_ERR_ESPNOW_NOT_FOUND, state->address,
                               session->channel);
            return false;
        }
    }
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (!atomic_compare_exchange_strong_explicit(
            &session->pending_tracked_send, &expected, state,
            memory_order_acq_rel, memory_order_acquire)) {
        espnow_throw_error(ctx, "ESPNOW_CLOSING", ESP_ERR_INVALID_STATE,
                           state->address, session->channel);
        return false;
    }
    espnow_notify_tx_worker(session);
    return true;
}

static esp_err_t espnow_restore_native_session(espnow_session_t *session)
{
    if (session->power_save_fault || session->now_initialized ||
        session->receive_callback_registered || session->send_callback_registered)
        return ESP_ERR_INVALID_STATE;
    esp_now_peer_info_t peer_info = {0};
    esp_err_t err;
    uint32_t i;

    err = esp_now_init();
    if (err != ESP_OK) {
        return err;
    }
    session->now_initialized = true;
    err = esp_now_register_recv_cb(espnow_receive_callback);
    if (err != ESP_OK) {
        return err;
    }
    session->receive_callback_registered = true;
    err = esp_now_register_send_cb(espnow_send_callback);
    if (err != ESP_OK) {
        return err;
    }
    session->send_callback_registered = true;
    if (session->has_pmk) {
        err = esp_now_set_pmk(session->pmk);
        if (err != ESP_OK) {
            return err;
        }
    }
    memset(&peer_info, 0, sizeof(peer_info));
    memcpy(peer_info.peer_addr, s_broadcast_address,
           ESPNOW_ADDRESS_BYTES);
    peer_info.ifidx = WIFI_IF_STA;
    err = esp_now_add_peer(&peer_info);
    if (err != ESP_OK) {
        return err;
    }
    session->broadcast_peer_added = true;
    err = espnow_apply_rate_config(
        s_broadcast_address, &session->broadcast_rate_config);
    if (err != ESP_OK) {
        return err;
    }
    for (i = 0; i < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS; ++i) {
        espnow_peer_slot_t *peer = &session->peers[i];

        if (!peer->allocated) {
            continue;
        }
        memset(&peer_info, 0, sizeof(peer_info));
        memcpy(peer_info.peer_addr, peer->address, ESPNOW_ADDRESS_BYTES);
        peer_info.channel = peer->channel;
        peer_info.ifidx = WIFI_IF_STA;
        peer_info.encrypt = peer->encrypted;
        if (peer->encrypted) {
            memcpy(peer_info.lmk, peer->lmk, ESP_NOW_KEY_LEN);
        }
        err = esp_now_add_peer(&peer_info);
        if (err != ESP_OK) {
            return err;
        }
        err = espnow_apply_peer_rate_config(peer);
        if (err != ESP_OK) {
            return err;
        }
    }
    if (!session->power_save_enabled) {
        return ESP_OK;
    }
    const char *stage = NULL;
    return espnow_apply_power_save(session, true,
        session->wake_window_ms, session->wake_interval_ms, &stage);
}

static esp_err_t espnow_begin_timeout_recovery(
    espnow_session_t *session,
    esp32_mquickjs_future_driver_state_t *state)
{
    esp_err_t err = ESP_OK;

    if (session == NULL || state == NULL ||
        session->generation != state->generation) {
        return ESP_ERR_INVALID_STATE;
    }
    if (atomic_load_explicit(&state->recovery_pending,
                             memory_order_acquire)) {
        return state->err;
    }
    if (!esp32_mquickjs_wireless_tx_timeout(&session->tx_state) ||
        !esp32_mquickjs_wireless_tx_begin_recovery(&session->tx_state))
        return ESP_ERR_INVALID_STATE;
    state->timed_out = true;
    atomic_store_explicit(&state->recovery_pending, true,
                          memory_order_release);
    session->lifecycle = ESPNOW_LIFECYCLE_FAILED;
    atomic_store_explicit(&session->active_send, NULL,
                          memory_order_release);
    espnow_notify_tx_worker(session);
    if (session->receive_callback_registered) {
        err = esp_now_unregister_recv_cb();
        if (err == ESP_OK) session->receive_callback_registered = false;
    }
    if (session->send_callback_registered) {
        esp_err_t send_err = esp_now_unregister_send_cb();

        if (send_err == ESP_OK) session->send_callback_registered = false;
        if (err == ESP_OK) {
            err = send_err;
        }
    }
    state->err = err;
    return err;
}

static void espnow_send_recovery_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    espnow_session_t *session = &s_espnow_session;
    esp_err_t err;

    if (state == NULL) {
        return;
    }
    while (!session->receive_callback_registered && !session->send_callback_registered &&
           atomic_load_explicit(&session->callbacks_active,
                                memory_order_acquire) != 0) {
        vTaskDelay(1);
    }
    err = state->err;
    if (session->generation != state->generation) {
        err = ESP_ERR_INVALID_STATE;
    } else if (err == ESP_OK && session->now_initialized) {
        esp_err_t deinit_err = esp_now_deinit();

        if (deinit_err == ESP_OK) {
            session->now_initialized = false;
            session->broadcast_peer_added = false;
            espnow_note_native_deinit();
        }
        if (err == ESP_OK) {
            err = deinit_err;
        }
    }
    atomic_store_explicit(&session->active_send, NULL,
                          memory_order_release);
    state->timed_out = true;
    state->recovery_failed = err != ESP_OK;
    state->err = err == ESP_OK ? ESP_ERR_TIMEOUT : err;
    state->completed_at_us = esp_timer_get_time();
    (void)esp32_mquickjs_wireless_tx_finish_recovery(&session->tx_state,
                                                      false);
    atomic_fetch_add_explicit(&session->send_timeouts, 1,
                              memory_order_relaxed);
    session->lifecycle = ESPNOW_LIFECYCLE_FAILED;
    atomic_store_explicit(&state->completed, true, memory_order_release);
    atomic_store_explicit(&state->recovery_pending, false,
                          memory_order_release);
    (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    espnow_notify_tx_worker(session);
}

static bool espnow_schedule_send_recovery(
    esp32_mquickjs_future_driver_state_t *state)
{
    bool expected = false;

