99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
    if (state == NULL || !atomic_load_explicit(
            &state->recovery_pending, memory_order_acquire)) {
        return false;
    }
    if (!atomic_compare_exchange_strong_explicit(
            &state->recovery_worker_submitted, &expected, true,
            memory_order_acq_rel, memory_order_acquire)) {
        return expected;
    }
    if (esp32_mquickjs_future_submit_worker(
            state->runtime, state->token, espnow_send_recovery_worker,
            state)) {
        return true;
    }
    atomic_store_explicit(&state->recovery_worker_submitted, false,
                          memory_order_release);
    return false;
}

static esp32_mquickjs_future_poll_t espnow_send_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && atomic_load_explicit(
            &state->recovery_pending, memory_order_acquire)) {
        (void)espnow_schedule_send_recovery(state);
        return ESP32_MQUICKJS_FUTURE_PENDING;
    }
    return state != NULL && atomic_load_explicit(
                                &state->completed, memory_order_acquire)
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue espnow_send_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    char address[18];
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    if (state == NULL || state->cancelled) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_ThrowInternalError(ctx, "ESP-NOW send was cancelled");
    }
    if (state->timed_out) {
        JS_PopGCRef(ctx, &result_ref);
        return espnow_throw_error(
            ctx, state->recovery_failed ? "ESPNOW_RECOVERY_FAILED"
                                        : "ESPNOW_SEND_TIMEOUT",
            state->err, state->address, s_espnow_session.channel);
    }
    if (state->err != ESP_OK) {
        JS_PopGCRef(ctx, &result_ref);
        return espnow_throw_error(ctx, "ESPNOW_SEND_FAILED", state->err,
                                  state->address,
                                  s_espnow_session.channel);
    }
    espnow_format_address(state->address, address);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "address",
                                         JS_NewString(ctx, address)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "bytes",
            JS_NewInt64(ctx, (int64_t)state->payload_length)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "macDelivered",
            JS_NewBool(state->mac_delivered)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "completedAtUs",
            JS_NewInt64(ctx, state->completed_at_us))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static esp32_mquickjs_cancel_result_t espnow_send_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->started) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    state->cancelled = true;
    atomic_store_explicit(&state->completed, true, memory_order_release);
    return ESP32_MQUICKJS_CANCELLED;
}

static void espnow_send_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    if (state->generation == s_espnow_session.generation &&
        atomic_load_explicit(&s_espnow_session.active_send,
                             memory_order_acquire) == state) {
        atomic_store_explicit(&s_espnow_session.active_send, NULL,
                              memory_order_release);
    }
    if (state->generation == s_espnow_session.generation) {
        esp32_mquickjs_future_driver_state_t *expected = state;

        (void)atomic_compare_exchange_strong_explicit(
            &s_espnow_session.pending_tracked_send, &expected, NULL,
            memory_order_acq_rel, memory_order_acquire);
    }
    if (state->send_reserved &&
        state->generation == s_espnow_session.generation) {
        uint32_t pending = atomic_load_explicit(
            &s_espnow_session.pending_sends, memory_order_relaxed);

        if (pending > 0) {
            atomic_fetch_sub_explicit(&s_espnow_session.pending_sends, 1,
                                      memory_order_relaxed);
        }
    }
    if (state->owner_rooted) {
        JS_DeleteGCRef(state->ctx, &state->owner_ref);
    }
    esp32_mquickjs_memory_payload_free(state->payload);
    esp32_mquickjs_memory_payload_free(state);
}

static uint32_t espnow_send_timeout_ms(
    const esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL ? state->send_timeout_ms : 0;
}

static JSValue espnow_send_on_timeout(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state,
    uint32_t timeout_ms)
{
    bool pending_removed = false;

    (void)timeout_ms;
    if (state == NULL || !state->started) {
        return espnow_throw_error(
            ctx, "ESPNOW_SEND_TIMEOUT", ESP_ERR_TIMEOUT,
            state != NULL ? state->address : NULL,
            s_espnow_session.channel);
    }
    portENTER_CRITICAL(&s_espnow_session.lock);
    if (!atomic_load_explicit(&state->submitted, memory_order_acquire) &&
        atomic_load_explicit(&s_espnow_session.active_send,
                             memory_order_acquire) != state) {
        esp32_mquickjs_future_driver_state_t *expected = state;

        pending_removed = atomic_compare_exchange_strong_explicit(
            &s_espnow_session.pending_tracked_send, &expected, NULL,
            memory_order_acq_rel, memory_order_acquire);
    }
    portEXIT_CRITICAL(&s_espnow_session.lock);
    if (pending_removed) {
        state->timed_out = true;
        state->err = ESP_ERR_TIMEOUT;
        return espnow_throw_error(
            ctx, "ESPNOW_SEND_TIMEOUT", ESP_ERR_TIMEOUT,
            state->address, s_espnow_session.channel);
    }
    if (espnow_begin_timeout_recovery(&s_espnow_session, state) != ESP_OK &&
        !atomic_load_explicit(&state->recovery_pending,
                              memory_order_acquire)) {
        return espnow_throw_error(
            ctx, "ESPNOW_RECOVERY_FAILED", ESP_ERR_INVALID_STATE,
            state->address, s_espnow_session.channel);
    }
    (void)espnow_schedule_send_recovery(state);
    return espnow_throw_error(
        ctx, "ESPNOW_RECOVERY_PENDING", ESP_ERR_TIMEOUT,
        state->address, s_espnow_session.channel);
}

static esp32_mquickjs_resource_key_t espnow_send_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    (void)state;
    return &s_espnow_tx_lane_key;
}

static const esp32_mquickjs_future_driver_t s_espnow_send_driver = {
    .memory_owner = "wireless.future", .capture = espnow_send_capture,
    .start = espnow_send_start,
    .poll = espnow_send_poll,
    .finish = espnow_send_finish,
    .cancel = espnow_send_cancel,
    .destroy = espnow_send_destroy,
    .timeout_ms = espnow_send_timeout_ms,
    .on_timeout = espnow_send_on_timeout,
    .resource_key = espnow_send_resource_key,
};

static bool espnow_recover_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    espnow_session_ref_t *ref;

    (void)argv;
    if (out_state == NULL || argc != 0 ||
        JS_GetClassID(ctx, this_ref->val) != JS_CLASS_ESPNOW_SESSION ||
        (ref = JS_GetOpaque(ctx, this_ref->val)) == NULL) {
        JS_ThrowTypeError(ctx, "EspNowSession.recover() expects no arguments");
        return false;
    }
    if (ref->generation != s_espnow_session.generation ||
        s_espnow_session.power_save_fault ||
        s_espnow_session.lifecycle != ESPNOW_LIFECYCLE_FAILED ||
        s_espnow_session.tx_state != ESP32_MQUICKJS_WIRELESS_TX_FAILED) {
        espnow_throw_error(ctx, "ESPNOW_RECOVERY_FAILED",
                           ESP_ERR_INVALID_STATE, NULL,
                           s_espnow_session.channel);
        return false;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = ESPNOW_OPERATION_RECOVER;
    state->generation = ref->generation;
    atomic_init(&state->completed, false);
    espnow_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static esp_err_t espnow_cleanup_failed_restore(espnow_session_t *session)
{
    esp_err_t err = ESP_OK;

