99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
    if (session->receive_callback_registered) {
        err = esp_now_unregister_recv_cb();
        if (err == ESP_OK) session->receive_callback_registered = false;
    }
    if (session->send_callback_registered) {
        esp_err_t send_err = esp_now_unregister_send_cb();

        if (send_err == ESP_OK) session->send_callback_registered = false;
        if (err == ESP_OK) {
            err = send_err;
        }
    }
    if (err != ESP_OK) return err;
    while (atomic_load_explicit(&session->callbacks_active,
                                memory_order_acquire) != 0) {
        vTaskDelay(1);
    }
    if (session->now_initialized) {
        esp_err_t deinit_err = esp_now_deinit();

        if (deinit_err == ESP_OK) {
            session->now_initialized = false;
            session->broadcast_peer_added = false;
            espnow_note_native_deinit();
        }
        if (err == ESP_OK) {
            err = deinit_err;
        }
    }
    return err;
}

static void espnow_recover_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    espnow_session_t *session = &s_espnow_session;
    esp_err_t err = ESP_ERR_INVALID_STATE;

    if (state == NULL) {
        return;
    }
    if (session->generation == state->generation) {
        while (esp_timer_get_time() < s_espnow_reopen_not_before_us) {
            vTaskDelay(1);
        }
        err = espnow_restore_native_session(session);
        if (err != ESP_OK) {
            (void)espnow_cleanup_failed_restore(session);
        }
    }
    state->err = err;
    state->result_bool = err == ESP_OK;
    (void)esp32_mquickjs_wireless_tx_finish_recovery(&session->tx_state,
                                                      err == ESP_OK);
    session->lifecycle = err == ESP_OK ? ESPNOW_LIFECYCLE_ACTIVE
                                       : ESPNOW_LIFECYCLE_FAILED;
    espnow_notify_tx_worker(session);
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(state->runtime, state->token);
}

static bool espnow_recover_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    espnow_session_t *session = &s_espnow_session;

    if (state == NULL || state->generation != session->generation ||
        session->lifecycle != ESPNOW_LIFECYCLE_FAILED ||
        !esp32_mquickjs_wireless_tx_retry_recovery(&session->tx_state)) {
        espnow_throw_error(ctx, "ESPNOW_RECOVERY_FAILED",
                           ESP_ERR_INVALID_STATE, NULL, session->channel);
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (!esp32_mquickjs_future_submit_worker(
            runtime, token, espnow_recover_worker, state)) {
        (void)esp32_mquickjs_wireless_tx_finish_recovery(
            &session->tx_state, false);
        espnow_throw_error(ctx, "ESPNOW_RECOVERY_FAILED",
                           ESP_ERR_NO_MEM, NULL, session->channel);
        return false;
    }
    return true;
}

static JSValue espnow_recover_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->cancelled || state->err != ESP_OK) {
        return espnow_throw_error(
            ctx, "ESPNOW_RECOVERY_FAILED",
            state != NULL ? state->err : ESP_ERR_INVALID_STATE,
            NULL, s_espnow_session.channel);
    }
    return espnow_status_to_js(ctx, &s_espnow_session);
}

static const esp32_mquickjs_future_driver_t s_espnow_recover_driver = {
    .memory_owner = "wireless.future", .capture = espnow_recover_capture,
    .start = espnow_recover_start,
    .poll = espnow_control_poll,
    .finish = espnow_recover_finish,
    .cancel = espnow_control_cancel,
    .destroy = espnow_control_destroy,
    .resource_key = espnow_send_resource_key,
};

static bool espnow_register_future_drivers(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime)
{
    static const char *const session_names[] = {
        "addPeer", "broadcast", "setPowerSave", "recover", "close",
    };
    static const esp32_mquickjs_future_driver_t *const session_drivers[] = {
        &s_espnow_peer_add_driver,
        &s_espnow_send_driver,
        &s_espnow_power_save_driver,
        &s_espnow_recover_driver,
        &s_espnow_session_close_driver,
    };
    static const char *const peer_names[] = {
        "send", "update", "remove",
    };
    static const esp32_mquickjs_future_driver_t *const peer_drivers[] = {
        &s_espnow_send_driver,
        &s_espnow_peer_update_driver,
        &s_espnow_peer_remove_driver,
    };
    JSGCRef global_ref;
    JSGCRef module_ref;
    JSGCRef method_ref;
    JSGCRef session_ref;
    JSGCRef peer_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref);
    JSValue *module = JS_PushGCRef(ctx, &module_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue *session = JS_PushGCRef(ctx, &session_ref);
    JSValue *peer = JS_PushGCRef(ctx, &peer_ref);
    size_t index;
    bool result;

    *global = JS_GetGlobalObject(ctx);
    *module = JS_IsException(*global)
                  ? JS_EXCEPTION
                  : JS_GetPropertyStr(ctx, *global, "espNow");
    *method = JS_IsException(*module)
                  ? JS_EXCEPTION
                  : JS_GetPropertyStr(ctx, *module, "open");
    result = !JS_IsException(*method) &&
             esp32_mquickjs_future_register_driver(
                 ctx, runtime, *method, &s_espnow_open_driver);
    *session = result
                   ? JS_NewObjectClassUser(ctx, JS_CLASS_ESPNOW_SESSION)
                   : JS_EXCEPTION;
    *method = JS_IsException(*session)
                  ? JS_EXCEPTION
                  : JS_GetPropertyStr(ctx, *session, "receive");
    result = result && !JS_IsException(*method) &&
             esp32_mquickjs_event_queue_register_receive_alias(
                 ctx, runtime, *method);
    for (index = 0;
         result && index < sizeof(session_names) / sizeof(session_names[0]);
         ++index) {
        *method = JS_GetPropertyStr(ctx, *session, session_names[index]);
        result = !JS_IsException(*method) &&
                 esp32_mquickjs_future_register_driver(
                     ctx, runtime, *method, session_drivers[index]);
    }
    *peer = result ? JS_NewObjectClassUser(ctx, JS_CLASS_ESPNOW_PEER)
                   : JS_EXCEPTION;
    for (index = 0;
         result && index < sizeof(peer_names) / sizeof(peer_names[0]);
         ++index) {
        *method = JS_GetPropertyStr(ctx, *peer, peer_names[index]);
        result = !JS_IsException(*method) &&
                 esp32_mquickjs_future_register_driver(
                     ctx, runtime, *method, peer_drivers[index]);
    }
    if (!result && !JS_HasException(ctx)) {
        JS_ThrowInternalError(ctx,
                              "failed to register ESP-NOW Future drivers");
    }
    JS_PopGCRef(ctx, &peer_ref);
    JS_PopGCRef(ctx, &session_ref);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &module_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

bool esp32_mquickjs_init_espnow_runtime(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime)
{
    if (ctx == NULL || runtime == NULL ||
        !espnow_closed_and_quiescent(&s_espnow_session)) {
        return false;
    }
    return espnow_register_future_drivers(ctx, runtime);
}

void esp32_mquickjs_deinit_espnow_runtime(JSContext *ctx)
{
    (void)ctx;
    espnow_close_native(&s_espnow_session);
}

JSValue js_espnow_session_constructor(JSContext *ctx, JSValue *this_val,
                                      int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx,
                             "EspNowSession cannot be constructed directly");
}

void js_espnow_session_finalizer(JSContext *ctx, void *opaque)
{
    espnow_session_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && ref != &s_espnow_closed_session_ref &&
        ref->generation == s_espnow_session.generation) {
        espnow_request_reap(&s_espnow_session);
    }
    if (ref != &s_espnow_closed_session_ref) esp32_mquickjs_memory_payload_free(ref);
}

JSValue js_espnow_session_receive(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    if (this_val == NULL ||
        espnow_session_from_value(ctx, *this_val, true) == NULL) {
        JS_PopGCRef(ctx, &method_ref);
        return JS_EXCEPTION;
    }
    *method = JS_GetPropertyStr(ctx, *this_val, "receive");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

JSValue js_espnow_session_stats(JSContext *ctx, JSValue *this_val,
                                int argc, JSValue *argv)
{
    if (this_val == NULL ||
        espnow_session_from_value(ctx, *this_val, true) == NULL) {
        return JS_EXCEPTION;
    }
    return js_event_queue_stats(ctx, this_val, argc, argv);
}

