99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
JSValue js_espnow_session_status(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    espnow_session_t *session;

    (void)argc;
    (void)argv;
    if (this_val == NULL ||
        (session = espnow_session_from_value(ctx, *this_val, true)) == NULL) {
        return JS_EXCEPTION;
    }
    return espnow_status_to_js(ctx, session);
}

JSValue js_espnow_session_add_peer(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(ctx, "EspNowSession.addPeer() has no receiver");
    }
    return espnow_future_call_and_wait(ctx, *this_val, "addPeer", argc, argv);
}

JSValue js_espnow_session_peer(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    espnow_session_t *session;
    espnow_peer_slot_t *peer;
    uint8_t address[ESPNOW_ADDRESS_BYTES];
    uint16_t peer_index;

    if (this_val == NULL || argc != 1 ||
        (session = espnow_session_from_value(ctx, *this_val, true)) == NULL) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx,
                              "EspNowSession.peer(address) expects one address");
        }
        return JS_EXCEPTION;
    }
    if (!espnow_parse_address(ctx, argv[0], "EspNowSession.peer(address)",
                              false, address)) {
        return JS_EXCEPTION;
    }
    peer = espnow_find_peer_by_address(session, address, &peer_index);
    return peer == NULL ? JS_NULL
                        : espnow_new_peer_handle(ctx, peer_index, peer);
}

JSValue js_espnow_session_peers(JSContext *ctx, JSValue *this_val,
                                int argc, JSValue *argv)
{
    espnow_session_t *session;
    JSGCRef array_ref;
    JSGCRef entry_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *entry = JS_PushGCRef(ctx, &entry_ref);
    uint32_t peer_index;
    uint32_t output_index = 0;

    (void)argv;
    *array = JS_UNDEFINED;
    *entry = JS_UNDEFINED;
    if (this_val == NULL || argc != 0 ||
        (session = espnow_session_from_value(ctx, *this_val, true)) == NULL) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "EspNowSession.peers() expects no arguments");
        }
        goto fail;
    }
    *array = JS_NewArray(ctx, session->peer_count);
    if (JS_IsException(*array)) {
        goto fail;
    }
    for (peer_index = 0;
         peer_index < CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS;
         ++peer_index) {
        if (!session->peers[peer_index].allocated) {
            continue;
        }
        *entry = espnow_peer_status_to_js(ctx, &session->peers[peer_index]);
        if (JS_IsException(*entry) ||
            JS_IsException(JS_SetPropertyUint32(
                ctx, *array, output_index++, *entry))) {
            goto fail;
        }
    }
    JS_PopGCRef(ctx, &entry_ref);
    return JS_PopGCRef(ctx, &array_ref);

fail:
    JS_PopGCRef(ctx, &entry_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}

static bool espnow_array_length(JSContext *ctx, JSValue value,
                                uint32_t *out_length)
{
    JSGCRef length_ref;
    JSValue *length = JS_PushGCRef(ctx, &length_ref);
    int raw;
    bool result = false;

    if (out_length == NULL || !JS_IsArray(ctx, value)) {
        JS_ThrowTypeError(ctx, "expected an array");
        goto done;
    }
    *length = JS_GetPropertyStr(ctx, value, "length");
    if (JS_IsException(*length) || JS_ToInt32(ctx, &raw, *length) != 0 ||
        raw < 0) {
        if (!JS_HasException(ctx)) {
            JS_ThrowRangeError(ctx, "array length is invalid");
        }
        goto done;
    }
    *out_length = (uint32_t)raw;
    result = true;

done:
    JS_PopGCRef(ctx, &length_ref);
    return result;
}

static bool espnow_payload_source_length(JSContext *ctx, JSValue value,
                                         size_t *out_length)
{
    int class_id = JS_GetClassID(ctx, value);

    if (out_length == NULL) {
        return false;
    }
    if (class_id == JS_CLASS_BYTE_SPAN_SOURCE ||
        class_id == JS_CLASS_BITMAP_SPAN_SOURCE) {
        if (!esp32_mquickjs_byte_span_source_known_length(
                ctx, value, out_length)) {
            JS_ThrowTypeError(
                ctx,
                "ESP-NOW enqueue requires a ByteSpanSource with known byteLength");
            return false;
        }
        return true;
    }
    {
        esp32_mquickjs_byte_source_t source;
        uint8_t *owned = NULL;
        JSValue error = JS_UNDEFINED;

        if (!esp32_mquickjs_get_wireless_byte_source("espnow",
                ctx, value, "ESP-NOW enqueue payload", &source, &owned,
                &error)) {
            return false;
        }
        *out_length = source.length;
        esp32_mquickjs_release_byte_source(owned);
    }
    return true;
}

static bool espnow_copy_payload_source(JSContext *ctx, JSValue value,
                                       uint8_t *destination,
                                       size_t expected_length)
{
    int class_id = JS_GetClassID(ctx, value);

    if (class_id == JS_CLASS_BYTE_SPAN_SOURCE ||
        class_id == JS_CLASS_BITMAP_SPAN_SOURCE) {
        esp32_mquickjs_byte_span_source_t source;
        JSValue error = JS_UNDEFINED;
        size_t offset = 0;
        bool result = false;

        if (!esp32_mquickjs_open_byte_span_source(
                ctx, value, "ESP-NOW enqueue payload", &source, &error)) {
            return false;
        }
        while (true) {
            esp32_mquickjs_byte_span_t span;

            if (!esp32_mquickjs_byte_span_source_next(ctx, &source, &span)) {
                if (!JS_HasException(ctx) && offset == expected_length) {
                    result = true;
                }
                break;
            }
            if (span.length > expected_length - offset ||
                (span.length > 0 && span.data == NULL)) {
                JS_ThrowRangeError(
                    ctx,
                    "ESP-NOW ByteSpanSource length changed while enqueueing");
                break;
            }
            if (span.length > 0) {
                memcpy(destination + offset, span.data, span.length);
                offset += span.length;
            }
        }
        esp32_mquickjs_byte_span_source_close(ctx, &source);
        if (!result && !JS_HasException(ctx)) {
            JS_ThrowRangeError(
                ctx,
                "ESP-NOW ByteSpanSource length changed while enqueueing");
        }
        return result;
    }
    {
        esp32_mquickjs_byte_source_t source;
        uint8_t *owned = NULL;
        JSValue error = JS_UNDEFINED;

        if (!esp32_mquickjs_get_wireless_byte_source("espnow",
                ctx, value, "ESP-NOW enqueue payload", &source, &owned,
                &error)) {
            return false;
        }
        if (source.length != expected_length) {
            esp32_mquickjs_release_byte_source(owned);
            JS_ThrowRangeError(
                ctx, "ESP-NOW ByteSource length changed while enqueueing");
            return false;
        }
        if (source.length > 0) {
            memcpy(destination, source.data, source.length);
        }
        esp32_mquickjs_release_byte_source(owned);
    }
    return true;
}

static bool espnow_transfer_packet(JSContext *ctx, JSValue packet,
                                   uint8_t *destination,
                                   size_t capacity, size_t *out_length)
{
    static const char *const allowed[] = {"data", "parts"};
    JSGCRef data_ref, parts_ref, part_ref;
    JSValue *data = JS_PushGCRef(ctx, &data_ref);
    JSValue *parts = JS_PushGCRef(ctx, &parts_ref);
    JSValue *part = JS_PushGCRef(ctx, &part_ref);
    uint32_t part_count = 0;
    uint32_t part_index;
    size_t total = 0;
    bool result = false;

    *data = JS_UNDEFINED;
    *parts = JS_UNDEFINED;
    *part = JS_UNDEFINED;
    if (!espnow_is_object(ctx, packet) ||
        !espnow_validate_option_keys(ctx, packet, "ESP-NOW enqueue packet",
                                     allowed, 2U)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(
                ctx, "ESP-NOW packet must be { data } or { parts }");
        }
        goto done;
    }
    *data = JS_GetPropertyStr(ctx, packet, "data");
    *parts = JS_GetPropertyStr(ctx, packet, "parts");
    if (JS_IsException(*data) || JS_IsException(*parts)) {
        goto done;
    }
    if (JS_IsUndefined(*data) == JS_IsUndefined(*parts)) {
        JS_ThrowTypeError(ctx,
                          "ESP-NOW packet must contain exactly one of data or parts");
        goto done;
    }
    if (!JS_IsUndefined(*data)) {
        size_t length;

        if (!espnow_payload_source_length(ctx, *data, &length) ||
            length > capacity) {
            if (!JS_HasException(ctx)) {
                JS_ThrowRangeError(ctx,
                                   "ESPNOW_PAYLOAD_TOO_LARGE: packet exceeds maxPayloadBytes");
            }
            goto done;
        }
        if (destination != NULL &&
            !espnow_copy_payload_source(ctx, *data, destination, length)) {
            goto done;
        }
        total = length;
    } else {
        if (!espnow_array_length(ctx, *parts, &part_count) ||
            part_count == 0) {
            if (!JS_HasException(ctx)) {
                JS_ThrowRangeError(ctx,
                                   "ESP-NOW packet parts must be a non-empty array");
            }
            goto done;
        }
        for (part_index = 0; part_index < part_count; ++part_index) {
            size_t length;

            *part = JS_GetPropertyUint32(ctx, *parts, part_index);
            if (JS_IsException(*part) ||
                !espnow_payload_source_length(ctx, *part, &length) ||
                length > capacity - total) {
                if (!JS_HasException(ctx)) {
                    JS_ThrowRangeError(
                        ctx,
                        "ESPNOW_PAYLOAD_TOO_LARGE: packet parts exceed maxPayloadBytes");
                }
                goto done;
            }
            if (destination != NULL &&
                !espnow_copy_payload_source(
                    ctx, *part, destination + total, length)) {
                goto done;
            }
            total += length;
        }
    }
    *out_length = total;
    result = true;

done:
    JS_PopGCRef(ctx, &part_ref);
    JS_PopGCRef(ctx, &parts_ref);
    JS_PopGCRef(ctx, &data_ref);
    return result;
}

static void espnow_tx_queue_depth_locked(
    const espnow_session_t *session,
    uint32_t *out_batches,
    uint32_t *out_packets)
{
    uint16_t cursor;
    uint32_t previous_batch = 0;
    uint32_t batches = 0;
    uint32_t packets = 0;

    if (session->tx_queue_capacity == 0) {
        if (out_batches != NULL) {
            *out_batches = 0;
        }
        if (out_packets != NULL) {
            *out_packets = 0;
        }
        return;
    }
    if (session->tx_queue.active != ESP32_MQUICKJS_ESPNOW_TX_SLOT_NONE) {
        previous_batch = session->tx_queue.active_batch_sequence;
        batches = 1;
        packets = 1;
    }
    cursor = session->tx_queue.pending_head;
    while (cursor != ESP32_MQUICKJS_ESPNOW_TX_SLOT_NONE) {
        uint32_t batch = session->tx_links[cursor].batch_sequence;

        packets++;
        if (batch != previous_batch) {
            batches++;
            previous_batch = batch;
        }
        cursor = session->tx_links[cursor].next;
    }
    if (out_batches != NULL) {
        *out_batches = batches;
    }
    if (out_packets != NULL) {
        *out_packets = packets;
    }
}

static JSValue espnow_enqueue_result_to_js(
    JSContext *ctx, bool accepted, uint32_t batch_sequence,
    uint32_t packets, uint32_t bytes,
    const esp32_mquickjs_espnow_tx_reserve_result_t *reserve,
    uint32_t queued_batches, uint32_t queued_packets)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "accepted",
                                         JS_NewBool(accepted)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "reason",
            accepted ? JS_NULL : JS_NewString(ctx, "queue-full")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "batchSequence",
            accepted ? JS_NewUint32(ctx, batch_sequence) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "packets",
                                         JS_NewUint32(ctx, packets)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "bytes",
                                         JS_NewUint32(ctx, bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "evictedBatches",
            JS_NewUint32(ctx, reserve != NULL ? reserve->evicted_batches : 0)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "evictedPackets",
            JS_NewUint32(ctx, reserve != NULL ? reserve->evicted_packets : 0)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "queuedBatches", JS_NewUint32(ctx, queued_batches)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "queuedPackets", JS_NewUint32(ctx, queued_packets))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static JSValue espnow_enqueue(JSContext *ctx, JSValue receiver,
                              int argc, JSValue *argv, bool batch)
{
    espnow_session_t *session;
    espnow_peer_slot_t *peer = NULL;
    uint8_t address[ESPNOW_ADDRESS_BYTES];
    uint16_t reserved[CONFIG_ESP32_MQUICKJS_ESPNOW_TX_MAX_QUEUE_LEN];
    uint16_t lengths[CONFIG_ESP32_MQUICKJS_ESPNOW_TX_MAX_QUEUE_LEN];
    esp32_mquickjs_espnow_tx_reserve_result_t reserve = {0};
    uint32_t packet_count = 1;
    uint32_t packet_index;
    uint32_t total_bytes = 0;
    uint32_t batch_sequence;
    uint32_t queued_batches;
    uint32_t queued_packets;
    uint8_t actual_channel;
    wifi_second_chan_t secondary;
    uint32_t channel_generation;

