99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
    if (argc != 1) {
        return JS_ThrowTypeError(
            ctx, batch
                     ? "ESP-NOW enqueueBatch(packets) expects one packet array"
                     : "ESP-NOW enqueue(packet) expects one packet object");
    }
    if (JS_GetClassID(ctx, receiver) == JS_CLASS_ESPNOW_PEER) {
        peer = espnow_peer_from_value(ctx, receiver, NULL, true);
        if (peer == NULL) {
            return JS_EXCEPTION;
        }
        session = &s_espnow_session;
        memcpy(address, peer->address, ESPNOW_ADDRESS_BYTES);
    } else {
        session = espnow_session_from_value(ctx, receiver, true);
        if (session == NULL) {
            return JS_EXCEPTION;
        }
        memcpy(address, s_broadcast_address, ESPNOW_ADDRESS_BYTES);
    }
    if (session->lifecycle != ESPNOW_LIFECYCLE_ACTIVE ||
        session->tx_state != ESP32_MQUICKJS_WIRELESS_TX_READY) {
        return espnow_throw_error(ctx, "ESPNOW_NOT_OPEN",
                                  ESP_ERR_INVALID_STATE, address,
                                  session->channel);
    }
    if (session->tx_queue_capacity == 0) {
        return espnow_throw_error(ctx, "ESPNOW_TX_QUEUE_DISABLED",
                                  ESP_ERR_INVALID_STATE, address,
                                  session->channel);
    }
    if (batch &&
        (!espnow_array_length(ctx, argv[0], &packet_count) ||
         packet_count == 0)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowRangeError(ctx, "enqueueBatch requires a non-empty array");
        }
        return JS_EXCEPTION;
    }
    if (packet_count > session->tx_queue_capacity) {
        return JS_ThrowRangeError(
            ctx, "enqueue batch exceeds txQueue.capacityPackets");
    }
    for (packet_index = 0; packet_index < packet_count; ++packet_index) {
        JSGCRef packet_ref;
        JSValue *packet = JS_PushGCRef(ctx, &packet_ref);
        size_t length = 0;
        bool valid;

        *packet = batch ? JS_GetPropertyUint32(ctx, argv[0], packet_index)
                        : argv[0];
        valid = !JS_IsException(*packet) &&
                espnow_transfer_packet(ctx, *packet, NULL,
                                       session->max_payload_bytes, &length);
        JS_PopGCRef(ctx, &packet_ref);
        if (!valid) {
            return JS_EXCEPTION;
        }
        lengths[packet_index] = (uint16_t)length;
        total_bytes += (uint32_t)length;
    }
    if (espnow_channel_admit(session, true) != ESP_OK ||
        esp32_mquickjs_wifi_radio_get_channel(
            &actual_channel, &secondary, &channel_generation) != ESP_OK ||
        actual_channel != session->channel ||
        channel_generation != session->channel_generation ||
        (peer != NULL && peer->channel != 0 &&
         peer->channel != actual_channel)) {
        return espnow_throw_error(ctx, "ESPNOW_CHANNEL_MISMATCH",
                                  ESP_ERR_ESPNOW_CHAN, address,
                                  session->channel);
    }
    do {
        batch_sequence = atomic_fetch_add_explicit(
            &session->next_batch_sequence, 1, memory_order_relaxed);
    } while (batch_sequence == 0);
    portENTER_CRITICAL(&session->lock);
    if (!esp32_mquickjs_espnow_tx_queue_reserve_batch(
            &session->tx_queue, (uint16_t)packet_count, batch_sequence,
            session->tx_overflow, reserved, &reserve)) {
        espnow_tx_queue_depth_locked(session, &queued_batches,
                                     &queued_packets);
        portEXIT_CRITICAL(&session->lock);
        atomic_fetch_add_explicit(&session->tx_rejected_batches, 1,
                                  memory_order_relaxed);
        atomic_fetch_add_explicit(&session->tx_rejected_packets,
                                  packet_count, memory_order_relaxed);
        return espnow_enqueue_result_to_js(
            ctx, false, 0, packet_count, total_bytes, &reserve,
            queued_batches, queued_packets);
    }
    portEXIT_CRITICAL(&session->lock);
    for (packet_index = 0; packet_index < packet_count; ++packet_index) {
        JSGCRef packet_ref;
        JSValue *packet = JS_PushGCRef(ctx, &packet_ref);
        size_t copied = 0;
        uint16_t slot = reserved[packet_index];
        bool valid;

        *packet = batch ? JS_GetPropertyUint32(ctx, argv[0], packet_index)
                        : argv[0];
        valid = !JS_IsException(*packet) &&
                espnow_transfer_packet(
                    ctx, *packet,
                    session->tx_payloads +
                        ((size_t)slot * session->max_payload_bytes),
                    lengths[packet_index], &copied) &&
                copied == lengths[packet_index];
        JS_PopGCRef(ctx, &packet_ref);
        if (!valid) {
            portENTER_CRITICAL(&session->lock);
            esp32_mquickjs_espnow_tx_queue_release_reserved(
                &session->tx_queue, reserved, (uint16_t)packet_count);
            portEXIT_CRITICAL(&session->lock);
            return JS_EXCEPTION;
        }
        memcpy(session->tx_packets[slot].address, address,
               ESPNOW_ADDRESS_BYTES);
        session->tx_packets[slot].length = lengths[packet_index];
    }
    portENTER_CRITICAL(&session->lock);
    if (!esp32_mquickjs_espnow_tx_queue_commit_batch(
            &session->tx_queue, reserved, (uint16_t)packet_count,
            batch_sequence)) {
        esp32_mquickjs_espnow_tx_queue_release_reserved(
            &session->tx_queue, reserved, (uint16_t)packet_count);
        portEXIT_CRITICAL(&session->lock);
        return JS_ThrowInternalError(ctx,
                                     "ESP-NOW transmit queue commit failed");
    }
    espnow_tx_queue_depth_locked(session, &queued_batches,
                                 &queued_packets);
    portEXIT_CRITICAL(&session->lock);
    atomic_fetch_add_explicit(&session->tx_accepted_batches, 1,
                              memory_order_relaxed);
    atomic_fetch_add_explicit(&session->tx_accepted_packets, packet_count,
                              memory_order_relaxed);
    atomic_fetch_add_explicit(&session->tx_evicted_batches,
                              reserve.evicted_batches,
                              memory_order_relaxed);
    atomic_fetch_add_explicit(&session->tx_evicted_packets,
                              reserve.evicted_packets,
                              memory_order_relaxed);
    espnow_update_tx_high_water(session, queued_packets);
    espnow_notify_tx_worker(session);
    return espnow_enqueue_result_to_js(
        ctx, true, batch_sequence, packet_count, total_bytes, &reserve,
        queued_batches, queued_packets);
}

JSValue js_espnow_session_enqueue_broadcast(
    JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(
            ctx, "EspNowSession.enqueueBroadcast() has no receiver");
    }
    return espnow_enqueue(ctx, *this_val, argc, argv, false);
}

JSValue js_espnow_session_enqueue_broadcast_batch(
    JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(
            ctx, "EspNowSession.enqueueBroadcastBatch() has no receiver");
    }
    return espnow_enqueue(ctx, *this_val, argc, argv, true);
}

