99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
JSValue js_espnow_peer_enqueue(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(ctx,
                                 "EspNowPeer.enqueue() has no receiver");
    }
    return espnow_enqueue(ctx, *this_val, argc, argv, false);
}

JSValue js_espnow_peer_enqueue_batch(JSContext *ctx, JSValue *this_val,
                                     int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(ctx,
                                 "EspNowPeer.enqueueBatch() has no receiver");
    }
    return espnow_enqueue(ctx, *this_val, argc, argv, true);
}

JSValue js_espnow_session_flush_tx(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    espnow_session_t *session;
    esp32_mquickjs_runtime_t *runtime;
    uint32_t timeout_ms = UINT32_MAX;
    int64_t deadline_us = INT64_MAX;

    if (this_val == NULL || argc > 1 ||
        (session = espnow_session_from_value(ctx, *this_val, true)) == NULL) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx,
                              "EspNowSession.flushTx(timeoutMs?) expects at most one timeout");
        }
        return JS_EXCEPTION;
    }
    if (argc == 1 && !JS_IsUndefined(argv[0])) {
        if (!esp32_mquickjs_value_to_bounded_u32(
                ctx, argv[0], 0U, INT32_MAX, &timeout_ms)) {
            return JS_ThrowRangeError(
                ctx, "flushTx timeoutMs must be in the range 0..2147483647");
        }
        deadline_us = esp_timer_get_time() + (int64_t)timeout_ms * 1000;
    }
    runtime = esp32_mquickjs_get_active_runtime();
    while (true) {
        uint32_t queued_packets;

        portENTER_CRITICAL(&session->lock);
        espnow_tx_queue_depth_locked(session, NULL, &queued_packets);
        portEXIT_CRITICAL(&session->lock);
        if (queued_packets == 0) {
            return JS_TRUE;
        }
        if (session->lifecycle != ESPNOW_LIFECYCLE_ACTIVE ||
            esp_timer_get_time() >= deadline_us) {
            return JS_FALSE;
        }
        if (!esp32_mquickjs_wait_for_activity(
                runtime, timeout_ms == UINT32_MAX ? UINT32_MAX : 1U)) {
            return JS_FALSE;
        }
    }
}

JSValue js_espnow_session_broadcast(JSContext *ctx, JSValue *this_val,
                                    int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(ctx,
                                 "EspNowSession.broadcast() has no receiver");
    }
    return espnow_future_call_and_wait(ctx, *this_val, "broadcast", argc,
                                       argv);
}

JSValue js_espnow_session_set_power_save(JSContext *ctx, JSValue *this_val,
                                         int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(
            ctx, "EspNowSession.setPowerSave() has no receiver");
    }
    return espnow_future_call_and_wait(ctx, *this_val, "setPowerSave", argc,
                                       argv);
}

JSValue js_espnow_session_recover(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(ctx,
                                 "EspNowSession.recover() has no receiver");
    }
    return espnow_future_call_and_wait(ctx, *this_val, "recover", argc, argv);
}

JSValue js_espnow_session_close(JSContext *ctx, JSValue *this_val,
                                int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(ctx, "EspNowSession.close() has no receiver");
    }
    return espnow_future_call_and_wait(ctx, *this_val, "close", argc, argv);
}

JSValue js_espnow_peer_constructor(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx,
                             "EspNowPeer cannot be constructed directly");
}

void js_espnow_peer_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    if (opaque != &s_espnow_closed_peer_ref) esp32_mquickjs_memory_payload_free(opaque);
}

JSValue js_espnow_peer_status(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    espnow_peer_slot_t *peer;

    (void)argv;
    if (this_val == NULL || argc != 0 ||
        (peer = espnow_peer_from_value(ctx, *this_val, NULL, true)) == NULL) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "EspNowPeer.status() expects no arguments");
        }
        return JS_EXCEPTION;
    }
    return espnow_peer_status_to_js(ctx, peer);
}

JSValue js_espnow_peer_send(JSContext *ctx, JSValue *this_val,
                            int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(ctx, "EspNowPeer.send() has no receiver");
    }
    return espnow_future_call_and_wait(ctx, *this_val, "send", argc, argv);
}

JSValue js_espnow_peer_update(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(ctx, "EspNowPeer.update() has no receiver");
    }
    return espnow_future_call_and_wait(ctx, *this_val, "update", argc, argv);
}

JSValue js_espnow_peer_remove(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    if (this_val == NULL) {
        return JS_ThrowTypeError(ctx, "EspNowPeer.remove() has no receiver");
    }
    return espnow_future_call_and_wait(ctx, *this_val, "remove", argc, argv);
}

JSValue js_espnow_capabilities(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "apiVersion",
                                         JS_NewString(ctx, "v1")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "target",
                                         JS_NewString(ctx, CONFIG_IDF_TARGET)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "idfVersion",
                                         JS_NewString(ctx, IDF_VER)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "supported", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxPeers",
            JS_NewUint32(ctx, CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PEERS)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxEncryptedPeers",
            JS_NewUint32(ctx, CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxV1PayloadBytes",
            JS_NewUint32(ctx, ESP_NOW_MAX_DATA_LEN)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxPayloadBytes",
            JS_NewUint32(
                ctx, CONFIG_ESP32_MQUICKJS_ESPNOW_MAX_PAYLOAD_BYTES)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "v2Payloads",
            JS_NewBool(ESPNOW_V2_PAYLOAD_ENABLED)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "stationInterface",
                                         JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "softApInterface",
                                         JS_FALSE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "powerSave", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "peerRateConfig",
                                         JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "broadcastRateConfig",
                                         JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "txQueue", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxTxQueuePackets",
            JS_NewUint32(
                ctx, CONFIG_ESP32_MQUICKJS_ESPNOW_TX_MAX_QUEUE_LEN))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

