99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/espnow/esp32_mquickjs_espnow.c
JSValue js_espnow_open(JSContext *ctx, JSValue *this_val,
                       int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    if (this_val == NULL) {
        JS_PopGCRef(ctx, &method_ref);
        return JS_ThrowTypeError(ctx, "espNow.open() has no receiver");
    }
    *method = JS_GetPropertyStr(ctx, *this_val, "open");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

static JSValue espnow_status_to_js(JSContext *ctx,
                                   espnow_session_t *session)
{
    JSGCRef result_ref;
    JSGCRef power_save_ref;
    JSGCRef tx_queue_ref;
    JSGCRef broadcast_rate_config_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *power_save = JS_PushGCRef(ctx, &power_save_ref);
    JSValue *tx_queue = JS_PushGCRef(ctx, &tx_queue_ref);
    JSValue *broadcast_rate_config = JS_PushGCRef(
        ctx, &broadcast_rate_config_ref);
    uint8_t channel = 0;
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE;
    uint32_t channel_generation = 0;
    bool synchronized = false;
    uint32_t queued_batches = 0;
    uint32_t queued_packets = 0;
    int tx_last_error = atomic_load_explicit(
        &session->tx_last_error, memory_order_relaxed);

    *result = JS_NewObject(ctx);
    *power_save = JS_NewObject(ctx);
    *tx_queue = JS_NewObject(ctx);
    *broadcast_rate_config = espnow_peer_rate_config_to_js(
        ctx, &session->broadcast_rate_config);
    if (session->tx_queue_capacity > 0) {
        portENTER_CRITICAL(&session->lock);
        espnow_tx_queue_depth_locked(session, &queued_batches,
                                     &queued_packets);
        portEXIT_CRITICAL(&session->lock);
    }
    if (espnow_channel_admit(session, true) == ESP_OK &&
        esp32_mquickjs_wifi_radio_get_channel(
            &channel, &secondary, &channel_generation) == ESP_OK) {
        synchronized = channel == session->channel &&
                       channel_generation == session->channel_generation;
    }
    if (JS_IsException(*result) || JS_IsException(*power_save) ||
        JS_IsException(*tx_queue) || JS_IsException(*broadcast_rate_config) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "open", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "interface",
                                         JS_NewString(ctx, "station")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "channel",
                                         JS_NewUint32(ctx, session->channel)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "channelGeneration",
            JS_NewUint32(ctx, session->channel_generation)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "channelSynchronized",
                                         JS_NewBool(synchronized)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxPayloadBytes",
            JS_NewUint32(ctx, session->max_payload_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "v1Compatible",
            JS_NewBool(session->max_payload_bytes <= ESP_NOW_MAX_DATA_LEN)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "broadcastRateConfig", *broadcast_rate_config) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "peerCount",
                                         JS_NewUint32(ctx, session->peer_count)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "encryptedPeerCount",
                                         JS_NewUint32(
                                             ctx,
                                             session->encrypted_peer_count)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "pendingSends",
                                         JS_NewUint32(
                                             ctx,
                                             atomic_load_explicit(
                                                 &session->pending_sends,
                                                 memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "txRecovering",
            JS_NewBool(session->tx_state ==
                       ESP32_MQUICKJS_WIRELESS_TX_RECOVERING)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "recoveryRequired",
            JS_NewBool(session->tx_state ==
                       ESP32_MQUICKJS_WIRELESS_TX_FAILED)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "receivedPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->received_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "receivedBytes",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->received_bytes,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "droppedPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->dropped_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "malformedPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->malformed_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "sentPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->sent_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "sentBytes",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->sent_bytes,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "sendSuccesses",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->send_successes,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "sendFailures",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->send_failures,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "sendTimeouts",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->send_timeouts,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "enabled",
            JS_NewBool(session->tx_queue_capacity > 0)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "capacityPackets",
            JS_NewUint32(ctx, session->tx_queue_capacity)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "overflow",
            session->tx_queue_capacity == 0
                ? JS_NULL
                : JS_NewString(
                      ctx,
                      session->tx_overflow ==
                              ESP32_MQUICKJS_ESPNOW_TX_DROP_OLDEST_BATCH
                          ? "drop-oldest-batch"
                          : "reject-newest")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "active",
            JS_NewBool(atomic_load_explicit(
                           &session->active_queued_slot,
                           memory_order_acquire) !=
                       ESP32_MQUICKJS_ESPNOW_TX_SLOT_NONE)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "queuedBatches",
            JS_NewUint32(ctx, queued_batches)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "queuedPackets",
            JS_NewUint32(ctx, queued_packets)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "highWaterPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_high_water_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "acceptedBatches",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_accepted_batches,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "acceptedPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_accepted_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "rejectedBatches",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_rejected_batches,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "rejectedPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_rejected_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "evictedBatches",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_evicted_batches,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "evictedPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_evicted_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "completedBatches",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_completed_batches,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "completedPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_completed_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "failedPackets",
            JS_NewUint32(ctx, atomic_load_explicit(
                                  &session->tx_failed_packets,
                                  memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, tx_queue, "lastError",
            tx_last_error == ESP_OK ? JS_NULL
                                    : JS_NewInt32(ctx, tx_last_error)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "txQueue",
                                         *tx_queue) ||
        !esp32_mquickjs_set_property_ref(ctx, power_save, "faulted", JS_NewBool(session->power_save_fault)) ||
        !esp32_mquickjs_set_property_ref(ctx, power_save, "restorePending",
            JS_NewBool(session->power_save_cleanup_required || session->interval_token.identity != 0U)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, power_save, "enabled",
            JS_NewBool(session->power_save_enabled)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, power_save, "wakeWindowMs",
            JS_NewUint32(ctx, session->wake_window_ms)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, power_save, "wakeIntervalMs",
            JS_NewUint32(ctx, session->wake_interval_ms)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "powerSave",
                                         *power_save)) {
        JS_PopGCRef(ctx, &broadcast_rate_config_ref);
        JS_PopGCRef(ctx, &tx_queue_ref);
        JS_PopGCRef(ctx, &power_save_ref);
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &broadcast_rate_config_ref);
    JS_PopGCRef(ctx, &tx_queue_ref);
    JS_PopGCRef(ctx, &power_save_ref);
    return JS_PopGCRef(ctx, &result_ref);
}

#endif
